{"id":"014493dd-0d9e-456b-9c4b-4e188854240b","title":"Space Fleet Cadet","gamefile": "spacecadet","chapters":[{"title":"Space Fleet Academy","id":0,"options":[{"text":"Take Space Fleet oath","goto":"1","with":"","without":""},{"text":"Quietly sneak out","goto":"2","with":"","without":""}],"item":"","text":"This is it - your final day at Space Fleet Academy. The culmination of seven years of intense training and now you are about to begin your first assignment as an officer cadet aboard a Space Fleet starship!\nAs you stand in the auditorium, ready to take your oath, you muse on the fact that officer cadets are the most expendable members of any mission and have the shortest life expectancy - Do YOU have what it takes to wear the Red Shirt? Can YOU survive?"},{"title":"Auditorium","id":1,"options":[{"text":"Board the SFV Temerarius","goto":"6","with":"","without":""},{"text":"Request a different assignment","goto":"5","with":"","without":""}],"item":"Red Shirt","text":"Ignoring your feeling of dread you take the Space Fleet oath with all the other cadets. Soon you are cheering and clapping your fellow cadets on the back in celebration before going to the noticeboards to find out which ships you have been assigned to.\nYou find your name on the board - you've been assigned to the Space Fleet Vessel - Temerarius.\nThis is the seventh starship to bear that name - the previous six were all lost in mysterious circumstances in far-flung regions of the galaxy."},{"title":"Corridor 15A","id":2,"options":[{"text":"Return to the auditorium","goto":"3","with":"","without":""},{"text":"Panic and run","goto":"4","with":"","without":""}],"item":"","text":"Making a feeble excuse about needing the toilet, you exit the auditorium and run down the corridor. As you speed round a corner you run smack into the Admiral. His assistant angrily helps the Admiral to his feet and shouts at you, \"Where are you going, cadet? Get back to the auditorium this instant.\""},{"title":"Outside the Auditorium","id":3,"options":[{"text":"Take the oath","goto":"1","with":"","without":""},{"text":"Scream and run away","goto":"4","with":"","without":""}],"item":"","text":"Nervously you look through the auditorium doors, your excitement and dread growing in equal measure. This should be one of the most important days of your life so why are you so scared that there is going to be some sort of catastrophe? Your great-great-grandmother was supposedly clairvoyant and an aunt on your mother's side once had a dream about a pig that came true, so hopefully this isn't a premonition."},{"title":"Fleeing","id":4,"options":[{"text":"Continue...","goto":"401","with":"","without":""}],"item":"","isEnd":false,"text":"In a panic, you sprint from the auditorium and flee down corridors, making your way towards the exit and freedom.\nAs you turn a corner you screech to a halt as three Space Fleet security guards run towards you. You turn to run the other way but three more guards are rushing at you from behind. Beams lash out from their phasers and your body is wracked with pain and paralysis as you crash unconscious to the floor..."},{"title":"Space Fleet Oath","id":5,"options":[{"text":"Report to the Temerarius","goto":"6","with":"","without":""},{"text":"Run away","goto":"4","with":"","without":""}],"item":"","text":"Nervously you approach the Admiral's chief aide and request a reassignment. She looks at you in disgust. \"Report to your assigned post, cadet,\" she snaps and dismisses you. The feeling of dread is becoming overwhelming. Is joining the Temerarius a glorious adventure to be had or a suicide mission like the previous six?"},{"title":"Transporter Room","id":6,"options":[{"text":"Go to the Bridge","goto":"7","with":"","without":""},{"text":"Go to the Ship's Mess","goto":"8","with":"","without":""},{"text":"Go to Engineering","goto":"9","with":"","without":""}],"item":"Phaser","text":"You report to the Space Fleet Academy transporter room and your particles are dissolved and transmitted to the SFV Temerarius for reassembly. The sparkly lights around you fade and you find yourself standing on the transporter pad of the Temerarius with the teleport operator welcoming you aboard. He issues you a phaser and downloads the ship's communicator codes and a map of the Temerarius to your wrist computer then hurries you from the room to make way for other cadets to beam up."},{"title":"The Bridge","id":7,"options":[{"text":"Report to the Captain","goto":"701","with":"","without":""},{"text":"Report to Tactical Officer","goto":"702","with":"","without":""},{"text":"Report to Communication Officer","goto":"703","with":"","without":""}],"text":"You make your way to the bridge. The doors slide open with a pleasing 'whoosh' and you get your first glimpse of the command centre of the SFV Temerarius. There are people everywhere at control panels. At the front of the bridge is a large viewscreen showing the stars rushing past at warp speed. Above the screen is the Space Fleet logo, the name of the ship and the motto of the SFV Temerarius - \"Preaceps in Discrimen Ruat\".\nIn the centre of the bridge is the man himself - Captain James Pitt.","item":""},{"title":"Ship's Mess","id":8,"options":[{"text":"Get something to eat","goto":"10","with":"","without":""},{"text":"Speak to the alien","goto":"11","with":"","without":""}],"text":"The ship's mess is virtually empty. Apart from one person serving food there is a single alien sitting at a table. You grab a menu on the way in - always handy to know what's for lunch on any given day!","item":"Menu"},{"title":"Engineering","id":9,"options":[{"text":"Introduce yourself","goto":"901","with":"","without":""},{"text":"Check warning light","goto":"902","with":"","without":""},{"text":"Press the button","goto":"903","with":"","without":""}],"text":"Using your wrist computer, you follow the map to the engineering department.\nEngineering is a bustle of activity with pieces of equipment humming and rumbling, control panels covered in winking lights and the quantum warp core glowing and pulsating in the centre of the huge room.\nThe head of engineering is standing by the warp core checking something on his wrist computer, a warning light is flashing on a nearby panel and there is a large red button that catches your eye.","item":""},{"title":"Food counter","id":"10","options":[{"text":"\"I'll have an omelette please.\"","goto":"12","with":"","without":""},{"text":"\"Rigellian death slug chowder.\"","goto":"13","with":"","without":""},{"text":"\"Xxarggian Zlobozny sounds interesting.\"","goto":"14","with":"","without":""}],"text":"\"Good day, cadet,\" says the chef behind the counter. He is a bright yellow Blorian and the red spots on his eye stalks identify him as coming from planet Bloria V.\nYou peruse the selection of foods, ranging from standard Earth food, through several alien dishes you recognise to some extremely strange looking foods you've never seen before and aren't entirely certain are edible or even dead. \n\"What can I get for you?\" asks the chef.","item":""},{"title":"Ship's Mess","id":"11","options":[{"text":"Select High Vulouran","goto":"1101","with":"","without":""},{"text":"Select Vulouran Trade Dialect","goto":"1102","with":"","without":""}],"text":"You approach the alien's table. You don't recognise what planet he is from but he has four arms, a dangerous-looking horn growing from his chin and thirteen glowing red eyes. \n\"Good day, friend,\" you begin cheerily but he is muttering something, apparently in a trance.\nYou tap a command into your wrist computer and the translator app pops up. After a moment it identifies the language as one from the Vuloura system but it can't determine whether it is High Vulouran or the Vulouran Trade Dialect.","item":""},{"title":"Ship's Mess","id":"12","options":[{"text":"Talk to the alien","goto":"11","with":"","without":""},{"text":"Go to the Bridge","goto":"7","with":"","without":""}],"text":"You take you omelette and a titanium-iridium space spork over to a free table. The omelette is pretty delicious actually, better than you were expecting and at least you can be certain it's edible. When you've finished, you pocket the spork, throw the plate in the recyle-O-tron and decide what to do next.","item":"Titanium-iridium spork"},{"title":"Execution","id":"401","options":[],"text":"The court-martial is swift, as is the carrying out of the sentence. The Space Fleet executioner places the noose round your neck and presses the button that opens the trap door beneath your feet. As you drop, your final glimpse through the windows of Space Fleet Academy is of the night sky and the stars that could have been yours. As your neck snaps, the blackness that envelops you is deeper and more final than any to be found in space.","item":"","isEnd":true},{"title":"Ship's Mess","id":"13","options":[],"text":"The chef hands you a steaming hot bowl of Rigellian death slug chowder and an edible straw. It smells delicious!\nYou take a seat and slurp a mouthful of the chowder. Is that a hint of cinnamon in there?\nToo late you recall that the Rigellian death slug is deadly poison to humans. It's Ridallian death slug that is edible.\nYou lower jaw dissolves and blood squirts from your eyes. Every neuron in your brain fires at once, frying your entire head to a crisp and you fall to the floor, VERY dead.","item":"","isEnd":true},{"title":"Ship's Mess","id":"14","options":[{"text":"Talk to the alien","goto":"11","with":"","without":""},{"text":"Go to the Bridge","goto":"7","with":"","without":""}],"text":"The chef hands you a slice of Xxarggian Zlobozny and a titanium-iridium space spork. You take the plate to a table, trying to stab the tentacles rapidly growing from it. You pour the sachet of bubbling slime over it and tuck in. It's every bit as delicious as it looks! When you've finished, you pocket the spork, throw the plate in the recyle-O-tron and decide what to do next.","item":"Titanium-iridium spork"},{"title":"Ship's Mess","id":"1101","options":[{"text":"Call security","goto":"1103","with":"","without":""},{"text":"Attack the creature","goto":"1104","with":"","without":""},{"text":"Run","goto":"1105","with":"","without":""}],"text":"You select High Vulouran and your wrist computer begins to translate.\n\"All hail Great Zarg. May my sacrifice please him. Death and destruction to the enemies of Zarg.\"\nThe creature opens his robe and starts to fiddle with controls on the technical-looking vest beneath it.","item":""},{"title":"Ship's Mess","id":"1102","options":[],"text":"You select Vulouran Trade Dialect and your wrist computer translates.\n\"My hovercraft is full of eels.\"\nThe alien opens its robe and presses a button on the vest beneath it.\n\"This is my gift, O friend of my mother's old <untranslateable> instructor.\"\nThere is an urgent beeping coming from the vest. You look confused but not for long. A bright flash reduces you to your component atoms, along with a large chunk of the ship, the remainder of which plunges in flames into the nearest star.","item":"","isEnd":true},{"title":"Ship's Mess","id":"1103","options":[{"text":"Continue","goto":"1106","with":"","without":""}],"text":"Backing away, you press the emergency button on your wrist computer. Within seconds you see the sparkling lights as a security team beams to your location. You point to the alien and the security guard shouts, \"Vulouran suicide priest!\"\nIn an instant, the security team zap the creature with their phasers and the alien is already half vapourised as one of the security guards throws the device that emergency teleports the creature three light seconds away from the ship, well outside the shields.","item":""},{"title":"Ship's Mess","id":"1104","options":[{"text":"Continue","goto":"1107","with":"","without":""}],"text":"You draw your phaser and fire at the creature, disintegrating the arm reaching for the controls. The creature screams and reaches with another arm. You fire again, vapourising the creature's left side. \nA security team beams in, reacting to the phaser fire. \"Vulouran suicide priest!\" shouts one and they all fire their phasers. The head of the security team calls an emergency teleport and the creature vanishes in sparkly lights, beamed three light seconds away, a safe distance from the ship.","item":""},{"title":"Ship's Mess","id":"1105","options":[],"text":"You turn to run and the alien shouts something.\n\"Death to the human scum!\" translates your wrist computer.\nThe alien grabs you from behind and you hear an urgent beeping, getting faster as a timer presumably counts down. You struggle to reach for your phaser but you are held too tightly. The alien shouts again - \"For the glory of the Vulouran Resistance!\"\nThere is a bright flash and you are vapourised, along with half the ship, the remainder of which hurtles in flames into the nearest star.","item":"","isEnd":true},{"title":"Ship's Mess","id":"1106","options":[{"text":"Go to the Bridge","goto":"7","with":"","without":""}],"text":"\"Well done, Cadet,\" smiles the leader of the security team, clapping you on the shoulder.\nThrough the window you see a bright flash as the alien explodes harmlessly in the distance.\n\"I don't know how that thing got on the ship but it's good that you spotted it in time.\"\nThe security team tap their wrist computers and vanish in sparkly lights, beamed back to their station.","item":""},{"title":"Ship's Mess","id":"1107","options":[{"text":"Go to the Bridge","goto":"7","with":"","without":""}],"text":"\"That was quick thinking, Cadet,\" smiles the head of the security team, clapping you on the shoulder. \"I don't know how that thing got on here but you spotted it just in time.\"\nHe glances at the phaser you are holding. \"They didn't give you one of those old things did they? Typical. Here, take this and don't tell anyone.\"\nHe hands you an upgraded power pack for your phaser. \"This should give your phaser a bit more power.\"\nThe security team vanish in sparkly lights, beamed back to their station.\n","item":"Phaser upgrade"},{"title":"Engineering","id":"901","options":[{"text":"\"What's that?\"","goto":"9011","with":"","without":""},{"text":"\"What's that?\"","goto":"9012","with":"","without":""},{"text":"\"What's that?\"","goto":"9013","with":"","without":""},{"text":"\"What's that warning light?\"","goto":"9021","with":"","without":""}],"text":"You salute the head of engineering.\n\"Ah, welcome aboard, Cadet. Let me show you around. What were you interested in looking at?\"","item":"Engineering manuals"},{"title":"Engineering","id":"9011","options":[{"text":"\"What's that?\"","goto":"9012","with":"","without":"Tachyon info"},{"text":"\"What's that?\"","goto":"9013","with":"","without":"Emergency protocol"},{"text":"\"What's that warning light?\"","goto":"9021","with":"","without":""}],"text":"\"This is the quantum warp core. It powers the whole ship and allows us to travel faster than light. About once a week the Captain finds an excuse to eject the core or activate the ship's self-destruct. It's our job to come up with a last-minute solution that saves us from doing either of those things. Here, let me download the schematics to your wrist computer so you can study them later.\"","item":"Warp Core schematics"},{"title":"Engineering","id":"9012","options":[{"text":"\"What's that?\"","goto":"9011","with":"","without":"Warp Core schematics"},{"text":"\"What's that?\"","goto":"9013","with":"","without":"Emergency protocol"},{"text":"\"What's that warning light?\"","goto":"9021","with":"","without":""}],"text":"\"That's the Winstone Generator. It's where we get our modified tachyons. We use them for all sorts of things. It also allows us to revers the polarity on them if we need to. Here, I'll download some info on tachyons to your wrist computer.\"","item":"Tachyon info"},{"title":"Engineering","id":"9013","options":[{"text":"\"What's that?\"","goto":"9011","with":"","without":"Warp Core schematics"},{"text":"\"What's that?\"","goto":"9012","with":"","without":"Tachyon info"},{"text":"\"What's that warning light?\"","goto":"9021","with":"","without":""}],"text":"\"That's the quantum warp core compensator. These warp cores have a tendency to go into overload every so often.\"\nHe points to a couple of the controls. \"It's not usually an issue. If it happens we just set the Tesla dial to 14.379 and pull the Rutherford lever to reset it. It's all in the emergency protocol. Here, I'll send a copy to your wrist computer.\"","item":"Emergency protocol"},{"title":"Engineering","id":"902","options":[{"text":"Press the red button","goto":"903","with":"","without":""},{"text":"Get help","goto":"904","with":"","without":""},{"text":"Leave it alone","goto":"906","with":"","without":""}],"text":"You walk over to the flashing light. There is a label beneath it: 'Quantum Warp Core Overload - Initiate Emergency Protocol'.","item":""},{"title":"Engineering","id":"9021","options":[{"text":"Press the red button","goto":"903","with":"","without":""},{"text":"Start Emergency Protocol","goto":"905","with":"Emergency protocol","without":""},{"text":"Go to control panel","goto":"907","with":"","without":"Emergency protocol"}],"text":"The head of engineering glances at the light. \"The warp core is overloading!\"\nHe rushes to a control panel and starts tapping buttons.\n\"A fragment of quantum superstring got in through the Bussard ram scoop and into the plasma filters!\"\nHe taps some more buttons and alarms begin to blare.\n\"We're losing containment!\" The control panel explodes with a flash of sparks. The head of engineering collapses to floor with third degree burns. \"Reset the warp core...\" he croaks before falling unconscious.","item":""},{"title":"Engineering","id":"904","options":[{"text":"Press the red button","goto":"903","with":"","without":""},{"text":"Go to control panel","goto":"907","with":"","without":""}],"text":"\"Help!\" you shout, then, \"Help!\" again.\nThe head of engineering rushes over and glances at the light. \"The warp core is overloading!\"\nHe rushes to a control panel and starts tapping buttons.\n\"A fragment of quantum superstring got into the plasma filters!\"\nAlarms begin to blare.\n\"We're losing containment!\" The control panel explodes with a flash of sparks. The head of engineering collapses to floor with third degree burns. \"Reset the warp core...\" he croaks before falling unconscious.","item":""},{"title":"Engineering","id":"903","options":[],"text":"You slap your palm against the red button. \nA computerised voice says, \"Warning. ejection of the quantum warp core in 5...4...3...\"\nThe communicator sounds, \"Bridge to engineering! Why are you ejecting the core?\" Alarms are sounding throughout the whole ship now.\n\"...2...1\" continues the computer. \"Core ejected.\"\nThe glowing warp core folds in on itself and vanishes.\nDevoid of power, life support and communications, the ship tumbles lifeless and frozen through space for the rest of eternity.","item":"","isEnd":true},{"title":"Engineering","id":"906","options":[{"text":"Press the red button","goto":"903","with":"","without":""},{"text":"Call for help","goto":"904","with":"","without":""},{"text":"Leave Engineering","goto":"9061","with":"","without":""}],"text":"You decide that it's better not to touch something you don't understand. You take a quick look round to make sure nobody has seen you looking, so that you don't get the blame for it if something goes wrong. Nobody seems to have noticed you so you saunter away, whistling causally.\nSuddenly an alarm starts to sound. This can't be good. Perhaps a warp core overload isn't something that should be ignored?","item":""},{"title":"Corridor","id":"9061","options":[],"text":"Deciding that the engineering team probably know what they are doing, you hurriedly exit the engineering room to get out of their way. The alarms are still sounding and a computerised voice is adding to the chaos, \"Warning! Plasma filter breach. All hands abandon ship!\"\nYou don't have time to find the nearest escape pod before the exploding quantum warp core disintegrates you, the ship and everything within half a parsec as you burn brighter than the sun for a fraction of a second.","item":"","isEnd":true},{"title":"Engineering","id":"905","options":[{"text":"Press the red button","goto":"903","with":"","without":""},{"text":"Pull the Rutherford lever","goto":"9051","with":"","without":""},{"text":"Turn the Tesla dial","goto":"9052","with":"","without":""},{"text":"Use Winstone Generator","goto":"9053","with":"","without":""}],"text":"You rush to the control panel, trying to remember what the head of engineering said about the emergency protocol. There's no time to lose and no time to find it on your wrist computer! What do you do?","item":""},{"title":"Engineering","id":"9051","options":[],"text":"You pull the Rutherford lever and the loud humming from the quantum warp core gradually gets quieter.\n\"Warp core shutdown initiated,\" intones the computer.\nThe communicator sounds, \"Bridge to engineering! Why are you shutting the core down?\"\nThe glowing warp core folds in on itself and vanishes.\nDevoid of power, life support and communications, the ship tumbles lifeless and frozen through space for the rest of eternity.","item":"","isEnd":true},{"title":"Engineering","id":"9052","options":[{"text":"Set dial to 13.479","goto":"9054","with":"","without":""},{"text":"Set dial to 14.379","goto":"9055","with":"","without":""},{"text":"Set dial to 19.473","goto":"9056","with":"","without":""}],"text":"You grab the Tesla dial and begin to turn it. But what was the setting?","item":""},{"title":"Engineering","id":"9053","options":[],"text":"You press the button to start the Winstone generator. A dial lights up and a needle starts to move towards the green zone. Phew!\nThe alarms are still sounding though.\nThe communicator pings, \"Bridge to Engineering - we're reading a dangerous spike in reverse polarity tachyons!\"\n\"Tachyon containment breach! Warp core implosion imminent!\" screams the computer voice.\n\"What the f...?\" is all you manage before the ship vanishes in an artificial supernova that can bee seen across the entire galaxy.","item":"","isEnd":true},{"title":"Engineering","id":"9054","options":[{"text":"Press the red button","goto":"903","with":"","without":""},{"text":"Pull the Rutherford lever","goto":"9051","with":"","without":""},{"text":"Activate Winstone Generator","goto":"9053","with":"","without":""}],"text":"You turn the dial. The alarms continue and the hum from the quantum warp core is nearly deafening. \nWhat now?","item":""},{"title":"Engineering","id":"9055","options":[{"text":"Press the red button","goto":"903","with":"","without":""},{"text":"Pull the Rutherford lever","goto":"9056","with":"","without":""},{"text":"Activate Winstone Generator","goto":"9053","with":"","without":""}],"text":"You set the Tesla dial to 14.379. One of the alarms stops and the hum from the quantum warp core decreases slightly. Now what?","item":""},{"title":"Engineering","id":"9056","options":[{"text":"Report to the Bridge","goto":"7","with":"","without":""}],"text":"You pull the Rutherford lever and the alarms stop. The noise from the quantum warp core reduces to its normal level. The head of engineering manages to open one badly-burned eye.\n\"Well done, Cadet. You'll get a commendation in your report for this. Now get me to sick bay.\"\nYou call the ship doctor on you communicator and sparkly lights envelope the head of engineering as he is beamed to sick bay.\nThat was exciting! \nNow what?","item":"Engineering commendation"},{"title":"Engineering","id":"907","options":[{"text":"Press the red button","goto":"903","with":"","without":""},{"text":"Turn the Tesla dial","goto":"9057","with":"","without":""},{"text":"Pull the Rutherford lever","goto":"9051","with":"","without":""},{"text":"Activate Winstone Generator","goto":"9053","with":"","without":""}],"text":"You look at the control panel in confusion. Alongside the red button there is a dial marked 'Tesla', a lever marked 'Rutherford' and a button marked 'Winstone Generator'. What do you do?","item":""},{"title":"Engineering","id":"9057","options":[{"text":"Green dot","goto":"9054","with":"","without":""},{"text":"Snake heiroglyph","goto":"9054","with":"","without":""},{"text":"'Q'","goto":"9054","with":"","without":""},{"text":"Random number","goto":"9055","with":"","without":""}],"text":"You grab the Tesla dial. Without any training in the Engineering Emergency Protocol, you'll just have to guess what setting is required. You take a closer look and none of the available setting make any sense to you. There are numbers, coloured markings, some letters and what appear to be Egyptian hieroglyphs.\nQuickly! What setting do you choose?","item":""},{"title":"Bridge","id":"701","options":[{"text":"Go to navigation console","goto":"7011","with":"","without":""}],"text":"\"Reporting for duty, Captain,\" you exclaim nervously with a smart salute.\n\"Welcome aboard, Cadet,\" replies the Captain. He is tall and handsome with an almost overwhelming presence and, seeing him in the flesh, you can believe that he lives up to his reputation. \"Take the navigation console, Cadet. We're approaching the uncharted zone. Bring us out of warp drive.\"","item":""},{"title":"Tactical","id":"702","options":[{"text":"Sit at tactical console","goto":"7051","with":"","without":""}],"text":"\"Reporting for duty, Sir,\" you exclaim with a sharp salute.\nThe Tactical Officer - the second in command of the Temerarius - regards you with cool appraisal and returns your salute.\n\"Take your seat, Cadet. We're approaching the uncharted zone and just about to come out of warp.\"","item":""},{"title":"Communications","id":"703","options":[{"text":"Sit at comms console","goto":"7033","with":"","without":""}],"text":"\"Reporting for duty, Ma'am,\" you exclaim with a sharp salute.\nThe Communications Officer returns your salute with a warm smile. \"Welcome aboard, Cadet. Glad to have you. Grab an earpiece and I'll show you the ropes. We're just about to come out of warp so we need to be ready in case there's anyone we need to communicate with or any transmissions we need to interpret.\"","item":""},{"title":"Navigation","id":"7011","options":[{"text":"Press 'Warp shutdown'","goto":"7012","with":"","without":""},{"text":"Engage retro thrusters","goto":"7013","with":"","without":""},{"text":"Pull 'Warp' lever","goto":"7014","with":"","without":""}],"text":"You sit at the navigation console and the Lieutenant sitting next to you pings the navigation access codes to your wrist computer.\n\"Okay Cadet,\" she says, \"bring us out of warp nice and gently.\"\n\"Yes ma'am,\" you reply and look at the console. You know you've been trained for this. You spent over thirteen hundred hours in a simulator training for this. So why are you blanking all of a sudden? \nThe lieutenant is looking at you sternly. Better do something!","item":"Navigation codes"},{"title":"Navigation","id":"7012","options":[{"text":"Apologise","goto":"7015","with":"","without":""}],"text":"You press the button marked 'Warp shutdown'. The lieutenant screams and jumps at you, pushing you out of the way. Alarms begin to sound and the ship lurches to one side, then the other, throwing people off their feet and across the bridge. People are shouting and pressing buttons.\nEventually the movement of the ship calms down and the alarms stop.\n\"What are you doing?\" yells the Lieutenant. \"You almost shut down the warp core! Another mistake like that and I'll have you thrown in the brig.\"","item":""},{"title":"Navigation","id":"7013","options":[],"text":"You press the button to fire the retro-thrusters. Instantly, the ship decelerates from 65 times the speed of light to nothing. The sudden stop throws you forward to splash against the viewscreen like a rotten tomato thrown at a wall. In Engineering the quantum warp core breaks free of its containment and shoots forwards through the ship, disintegrating everything in its path. Leaking dead bodies and air, the broken ship tumbles on into the uncharted zone, never to be seen again.","item":"","isEnd":true},{"title":"Navigation","id":"7014","options":[{"text":"Continue","goto":"7016","with":"","without":""}],"text":"Gently you pull back on the warp lever. The hum of the warp engines fades and the stars change from psychedelic streamers of colour to individual points of light.\nThe ship is travelling through space under its normal sub-light engines now.\n\"All ahead stop,\" orders Captain Pitt. You engage the retro-thrusters and the ship comes to a complete halt.\n\"Nicely done, Cadet,\" says the Lieutenant.\n\"Science station - full scan. Comms - full sweep. Let's see if anybody else is out there,\" says the Captain.","item":""},{"title":"Navigation","id":"7015","options":[{"text":"Take your seat","goto":"7016","with":"","without":""}],"text":"The lieutenant glares at your apology and pulls a lever, slowing the ship from warp to sub-light speed then to a complete halt. People pick themselves up off the floor and dust their uniforms off. Captain Pitt is standing exactly where he had been all along, not a hair out of place. The look of disappointment he gives you is more devastating than any amount of demerits.\n\"Full scan and comms sweep. Let's see if anybody else is out there,\" says the Captain.","item":""},{"title":"Uncharted Zone","id":"7016","options":[{"text":"Continue","goto":"7017","with":"","without":""}],"text":"\"Detecting a transmission,\" calls out the Comms Officer. \"From a small probe.\"\n\"Detecting unusual tachyon activity,\" reports the Tactical Officer.\nYou look at the viewscreen but can see only see stars.\n\"Vessel de-cloaking!\" shouts the Tactical Officer.\n\"The probe is transmitting to that vessel, Captain,\" calls the Comms Officer.\nThe lieutenant presses some buttons and the view on the screen shifts, coming to rest on a blurry shape appearing from nowhere.","item":""},{"title":"Uncharted Zone","id":"7017","options":[{"text":"Engage retro thrusters","goto":"7018","with":"","without":""},{"text":"Go to warp speed","goto":"7020","with":"","without":""},{"text":"Plot attack vector","goto":"7021","with":"","without":""}],"text":"The blurry shape resolves into a dangerous looking starship.\n\"Kramulons!\" you hear the Tactical Officer gasp. \"What are they doing so far from their empire?\"\n\"Red alert,\" orders the Captain. \"Raise shields, prepare for evasive manoeuvres and open hailing frequencies.\"\n\"Battle stations, Cadet,\" hisses the Lieutenant.\nThe menacing figure of a Kramulon warrior appears on the screen and you look to your controls, trying not to panic as you decide what to do.","item":""},{"title":"Kramulon attack","id":"7018","options":[{"text":"\"Getting us out of here!\"","goto":"7019","with":"","without":""},{"text":"\"Taking evasive action!\"","goto":"7019","with":"","without":""}],"text":"The Kramulon warrior gazes down at you from the viewscreen. His odd long snout and sickly grey-pink skin repelling you. He thumps his fist against the bronze scale armour as he bares his teeth and snarls in the strange piping sounds of his race.\nIt takes the ship computer a few moments to begin translating his speech and you are already engaging the retro thrusters as the translation begins.\n\"What are you doing now?!\" demands the Lieutenant.","item":""},{"title":"Kramulon attack","id":"7019","options":[{"text":"Plot attack vector","goto":"7027","with":"","without":""},{"text":"Go to warp","goto":"7020","with":"","without":""}],"text":"The ship begins to move backwards and the Captain shouts at you to stop.\nThe Kramulon warrior on the screen laughs evilly. \"Puny humans! Retreating in fear! You have no honour - prepare to die!\"\nThe screen returns to a view of the Kramulon ship.\n\"Weapons powering up!\" reports the Tactical Officer.\n\"You NEVER retreat from a Kramulon ship!\" shouts Captain Pitt. \"They'll attack instantly. Prepare to return fire. Cadet, get us out of the line of fire and get me a clear shot at their engines.\"","item":""},{"title":"Kramulon attack","id":"7020","options":[],"text":"\"We need to get out of here!\" you shout, reaching for the warp speed lever.\n\"Cadet, no!\" someone yells.\nYou slide the lever forward and the untold power of the quantum warp core hums through the whole ship.\n\"Kramulon vessel firing warp disruptors!\" screams the Tactical Officer.\nIn the instant before the warp core implodes spreading the ship across fifteen light years of space, you recall that the Kramulons have a weapon that can catastrophically destroy warp fields before they are fully formed.","item":"","isEnd":true},{"title":"Kramulon attack","id":"7021","options":[{"text":"Continue","goto":"7022","with":"","without":""}],"text":"You can hear the Captain arguing with the Kramulon warrior, exchanging threats and demanding to know why they are here. But you aren't paying close attention as you concentrate on laying in several potential manoeuvres, depending on whether the Captain chooses to fight or try to escape without battle.\nFrom your training you know that there is no reasoning or backing down from Kramulons - if they want a fight, then a fight will be had. And they always want a fight.","item":""},{"title":"Kramulon attack","id":"7022","options":[{"text":"Attack!","goto":"7023","with":"","without":""},{"text":"Flee!","goto":"7020","with":"","without":""}],"text":"\"Kramulon weapons powering up!\" snaps the Tactical Officer. \"Kramulon main engines targeted but we don't have a clear shot.\"\n\"Cadet, attack vector, now!\" orders the Captain.\nYou know the shields can probably take a hit from the Kramulon weapon but manoeuvring to hit their engines is risky. What do you do?","item":""},{"title":"Kramulon attack","id":"7023","options":[{"text":"Attack","goto":"7024","with":"","without":""},{"text":"Avoid fire","goto":"7025","with":"","without":""},{"text":"Escape now","goto":"7020","with":"","without":""}],"text":"You punch the controls and the ship leaps into action. Kramulon particle beams and dark matter torpedoes hurtle towards you but your programming is good and the beams only do minor damage and you avoid most of the torpedoes.\nNext to you, a console explodes in sparks, killing the cadet sat there.\n\"Fire!\" calls the Captain and a beam of unimaginable ferocity strikes out at the Kramulons.\n\"Direct hit!\" the Captain shouts. \"Kramulon engines disabled.\"\n\"Evasive manoeuvres, now.\" calls the Captain.","item":""},{"title":"Kramulon attack","id":"7024","options":[],"text":"Full of adrenalin now, you plot a course to attack the bridge of the Kramulon vessel. Time to finish this!\nThe Temerarius shudders as return fire from the Kramulon vessel damages your thrusters.\nDesperately you try to plot a course change to take you out of range but all you manage to do is turn the ship enough so that the incoming torpedo hits Engineering. The explosion of dark matter hitting the quantum warp core instantly reduces the ship to a spreading cloud of hard radiation.","item":"","isEnd":true},{"title":"Kramulon attack","id":"7025","options":[{"text":"Go to warp","goto":"7020","with":"","without":""},{"text":"Evade torpedoes","goto":"7026","with":"","without":""}],"text":"\"Aye aye Captain,\" you call back, hitting buttons and moving the ship away from a fresh barrage of dark matter torpedoes. The Kramulon vessel, unable to turn effectively with their damaged engines cannot bring their main weapons to bear.\n\"Fire!\" orders the Captain. \"Take out that particle beam.\"\nMore rods of destructive energy lash out from the Temerarius and several explosions blossom on the Kramulon vessel.\n\"Cadet, give us some room, they're firing more torpedoes.\"","item":""},{"title":"Kramulon attack","id":"7026","options":[{"text":"Continue","goto":"800","with":"","without":""}],"text":"You move the ship to a safer distance from the crippled Kramulon vessel, two more torpedoes hit and your ship shudders but no more are incoming.\n\"Open hailing frequencies,\" orders the Captain.\n\"Message refused,\" replies the Comms Officer.\nThe Captain's face turns grim. Not one Kramulon ship has ever surrendered, they always fight to the death.\n\"Finish them.\"\nOne final beam hurtles from the Temerarius, striking the warp core of the Kramulon vessel, disintegrating it.","item":""},{"title":"Kramulon attack","id":"7027","options":[{"text":"Go to warp","goto":"7020","with":"","without":""},{"text":"Evade","goto":"7028","with":"","without":""},{"text":"Attack","goto":"","with":"","without":""}],"text":"The sudden attack fro the Kramulons has left you no time to plot and evaluate potential manoeuvres. You realise that you can't do what the Captain asks and evade at the same time as putting the ship into a position to attack. You'll have to choose!","item":""},{"title":"Kramulon attack","id":"7028","options":[{"text":"Go to warp","goto":"7020","with":"","without":""},{"text":"All out attack","goto":"7029","with":"","without":""},{"text":"Ram them!","goto":"7031","with":"","without":""}],"text":"You punch the keys in front of you and the ship leaps into action, narrowly avoiding the incoming beams and torpedoes. Return fire lashes out from the Temerarius but is absorbed by the Kramulon shields with only minor damage to their vessel.\n\"Dammit Cadet, we need to take out their engines. Get me an attack vector now!\" commands the Captain.\n\"Kramulon ship has weapons lock on our engines and warp core,\" reports the Tactical Officer.\nYou're out of time with no good options! What do you do?","item":""},{"title":"Kramulon attack","id":"7029","options":[{"text":"Fire!","goto":"7030","with":"","without":""}],"text":"You plot a course that will allow you to attack but the relative positions of the two ships make it almost certain you will take heavy incoming fire. You remember a tactic you read about.\n\"Captain, I think I can turn us enough to get a shot at their warp core...if we put all power into the forward beam.\"\nThe Captain glances at the tactical display. \"We're out of time. Do it.\"\nYou wrestle with the controls, desperately willing the ship to turn before the Kramulon ship can attack again.","item":""},{"title":"Kramulon attack","id":"7030","options":[],"text":"\"Diverting all power to main weapon,\" reports the Tactical Officer.\nYou manage to bring the ship about. \"Now!\" you shout.\nThe lights in the Bridge dim and you hear the whine of the shields going down as the main weapon powers up. The beam lashes out, spearing through the Kramulon ship and into their warp core. At the same instant the Kramulons fire and the last thing you see is the barrage of torpedoes speeding towards your defenseless ship before both ships vanish in a hellish nuclear fury.","item":"","isEnd":true},{"title":"Kramulon attack","id":"7031","options":[{"text":"Fire!","goto":"7032","with":"","without":""}],"text":"You manage to evade more incoming fire but that is a losing tactic. Unfortunately they are pressing their advantage and you can't get a clear shot that doesn't also put you square in the Kramulon sights.\n\"How badly do you want to take them out, Captain?\" you ask, plotting another course.\n\"Just do it now, Cadet.\"\n\"Aye aye Captain.\" You punch the thruster and the ship lurches forward.\nThe Captain sees what you are doing. \"Full power to front shields. Ramming speed!\"\n","item":""},{"title":"Kramulon attack","id":"7032","options":[{"text":"Continue","goto":"800","with":"","without":""}],"text":"You hit the controls for full thrust and speed directly for the Kramulon ship. The alien torpedoes go wide and their beam is absorbed by your shields. A console explodes in a shower of sparks and the cadet there screams and falls to the floor, dead.\nDesperately, the Kramulon ship tries to evade. \"Fire!\" calls the Captain and your weapons lash out as you pass close to the side of the Kramulons, hitting their warp core. Your ship is buffeted by the explosion of the Kramulon ship as you race past.","item":""},{"title":"Communications","id":"7033","options":[{"text":"Run diagnostic","goto":"7034","with":"","without":""},{"text":"Apply algorithm","goto":"7036","with":"","without":""}],"text":"You sit at your console and the Communications Officer pings the access codes to your wrist computer. The Navigation Officer takes the ship out of warp and you begin to scan for transmissions.\nYou pick up a faint signal but you an't tell if it is artificial or something natural. The Communications Officer takes a look. \"Hmmm. could be nothing. See if you can clean the signal up a bit.\"","item":"Comms access"},{"title":"Communications","id":"7034","options":[{"text":"Continue","goto":"7035","with":"","without":""}],"text":"You remember this from training. You decide to run a diagnostic test of the sensor array, in case it's some sort of glitch causing this odd signal you've received. You select the diagnostic parameters and press go. The communications system shuts down and begins to reboot.\n\"Oops.\"\n\"What have you done!\" demands the Communications Officer angrily. \"You've shut down comms!\"\n\"Alien vessel de-cloaking!\" calls out the Tactical Officer.\n\"Red alert,\" shouts the Captain. \"Raise shields and hail them.\"","item":""},{"title":"Kramulon attack","id":"7035","options":[],"text":"\"Communications down, Captain!\" you reply.\n\"It's the Kramulons!\" gasps the Tactical Officer. \"What are they doing so far from their empire?\"\n\"Power up main weapon!\" orders the Captain.\n\"No comms with fire control or Engineering. Shields are still down Captain!\"\nOn the viewscreen is a Kramulon warship.\n\"Are they hailing us?\"\n\"Comms down,\" you remind the Captain.\nThe Kramulon ship turns to aim it's main weapon. The last thing you see is the barrage of torpedoes heading for your defenseless ship.","item":"","isEnd":true},{"title":"Communications","id":"7036","options":[{"text":"Continue","goto":"7037","with":"","without":""}],"text":"You use several algorithms you learnt at the Academy and manage to get a better signal.\n\"Detecting a transmission,\" you calls out to the Captain. \"From a small probe.\"\n\"Vessel de-cloaking!\" shouts the Tactical Officer.\nYou look up and the view on the screen shifts, coming to rest on a blurry shape appearing from nowhere.\nYou hit more buttons. \"The probe is transmitting to that vessel, Captain.\"","item":""},{"title":"Communications","id":"7037","options":[{"text":"Ask for help","goto":"7038","with":"","without":""},{"text":"Transmit access codes","goto":"7040","with":"","without":""},{"text":"Press green button","goto":"7043","with":"","without":""}],"text":"The blurry shape resolves into a dangerous looking starship.\n\"Kramulons!\" you hear the Tactical Officer gasp. \"What are they doing so far from their empire?\"\n\"Red alert,\" orders the Captain. \"Raise shields, prepare for evasive manoeuvres and open hailing frequencies.\"\nThe menacing figure of a Kramulon warrior appears on the screen and you look to your controls, trying not to panic as you try to remember how to open hailing frequencies.","item":""},{"title":"Communications","id":"7038","options":[{"text":"Continue","goto":"7039","with":"","without":""}],"text":"You stab a t a few buttons, not really sure you're doing this right. The Kramulon warrior is speaking but no sound is coming through, let alone being translated by the computer.\n\"Uh...how do I do this again?\" you ask the Communications Officer. With a sigh she waves you out of your seat and sits down to do it for you.\nShe presses a button and the weird piping language of the Kramulons fills the bridge. She presses another button and after a few moments the computer begins to translate.","item":""},{"title":"Kramulon attack","id":"7039","options":[],"text":"\"...while you ignore the greetings of the Kramulon empire. Prepare to die for this insult, puny humans!\"\n\"Kramulons opening fire!\"\nWith no time to divert more power to the front shields, the Kramulon beam disables your ship and the end is a foregone conclusion. You sit there looking in horror as the Kramulons fire enough torpedoes to overwhelm your shields. Within a minute it is all over and all that is left of you is some rapidly cooling chunks of meat, floating through the uncharted zone.","item":"","isEnd":true},{"title":"Communications","id":"7040","options":[{"text":"The emergency protocol!","goto":"7041","with":"Emergency protocol","without":""},{"text":"Continue","goto":"7042","with":"","without":"Emergency protocol"}],"text":"You press the control to send the access codes. Immediately, an alarm sounds.\n\"Oops!\"\n\"What have you done?\" demands the communications officer. \"You've just sent them all our access codes!\"\n\"Shields going down Captain!\" shouts the Tactical Officer. \"Main weapon powering down!\"\n\"What's happening?\" asks the Captain.\n\"They've taken control of our ship somehow.\"\n\"Can you override?\"\n\"Trying now? Oh no!\"\n\"What is it?\"\n\"They're overloading the quantum warp core! Engineering can't eject it!\"","item":""},{"title":"Kramulon attack","id":"7041","options":[],"text":"\"I know how to reset the warp core!\" you call out.\nEveryone turns to look at you?\n\"How?\" demands the Captain.\nYou struggle to remember the emergency protocol.\n\"You push the Rutherford Button...or is it the Rutherford dial? Then the Tesla switch. I think you set that to...\"\nThe looks the bridge crew give you are withering.\nYou are saved from further embarrassment by the sudden explosion of the quantum warp core turning the SFV Temerarius into a brief, but spectacular, supernova.","item":"","isEnd":true},{"title":"Kramulon attack","id":"7042","options":[],"text":"You panic and push random buttons as the first torpedo hits. \"We have to surrender!\"\n\"Didn't you do that when you sent them our access codes?\" asks Captain Pitt, drily.\n\"Maybe we can...\" begins the Tactical Officer as his console explodes, killing him.\n\"Let me try...\" begins another Officer before her console also explodes, splattering her all over the Captain.\n\"5 demerits for this, Cadet,\" says the Captain just before the bridge and you are vapourised by a direct hit from a dark matter torpedo.","item":"","isEnd":true},{"title":"Communications","id":"7043","options":[{"text":"Continue","goto":"7044","with":"","without":""}],"text":"You press the green button and the weird piping language of the Kramulons fills the bridge. The Kramulon warrior in his bronze scale armour gazes down at you from the viewscreen. His long snout and sickly grey-pink skin repel you. The computer begins translating.\n\"...sector has been claimed for the glory of the great Kramulon Empire. You are ordered to power down your shields and weapons to show surrender and you will be allowed to leave unharmed. You have 30 of your Earth seconds to comply.\"","item":""},{"title":"Communications","id":"7044","options":[{"text":"Send surrender message","goto":"7045","with":"","without":""},{"text":"Use sensor array","goto":"7046","with":"","without":""}],"text":"\"This is Captain James Pitt of the Space Fleet Vessel Temerarius. We are here on a peaceful exploration mission and do not recognise any claims to this sector of the galaxy.\"\nThe Captain looks magnificently defiant, as if ready to take on the entire Kramulon Empire single-handed if necessary.\n\"Power down your weapons and allow us to go about our business. You have 10 seconds to comply.\"\n\"No Captain, YOU have no seconds to comply.\"\n\"Kramulon weapons powering up,\" says the Tactical Officer.","item":""},{"title":"Kramulon attack","id":"7045","options":[{"text":"The emergency protocol!","goto":"7041","with":"Emergency protocol","without":""},{"text":"Continue","goto":"7042","with":"","without":"Emergency protocol"}],"text":"You press the control to send the surrender message. Immediately, an alarm sounds.\n\"What have you done?\" demands the Communications Officer.\n\"I was trying to surrender!\"\n\"You've just sent them all our access codes!\"\n\"Shields going down Captain!\" shouts the Tactical Officer. \"Main weapon powering down! They've taken control of our ship somehow.\"\n\"Can you override?\" asks the Captain.\n\"Trying now? Oh no!\"\n\"What is it?\"\n\"They're overloading the quantum warp core! Engineering can't eject it!\"","item":""},{"title":"Kramulon attack","id":"7046","options":[{"text":"Modify tachyons","goto":"7047","with":"","without":""}],"text":"The red alert klaxon is blaring and the Captain is shouting out orders and receiving reports from the various officers on the bridge. Consoles explode in sparks as beams and torpedoes from the Kramulon ship hit the Temerarius.\nYou press some buttons, checking parameters.\n\"Captain,\" you call out. \"I think I have an idea. If I use modified tachyons through the sensor array, I might be able to disrupt the guidance systems in the Kramulon dark matter torpedoes.\n\"Good idea, Cadet. Make it so.\"","item":""},{"title":"Kramulon attack","id":"7047","options":[{"text":"Normal polarity","goto":"7048","with":"","without":""},{"text":"Reverse polarity","goto":"7049","with":"","without":""}],"text":"Ignoring the lurching of the ship as the Navigation Officer evades incoming fire from the Kramulon ship and tries to manoeuvre into position to return fire effectively, you work on the sensor array.\nEngineering are a little busy keeping the engines and shields working while supplying enough power to the main weapon but they divert some modified tachyons to the sensor array for you. You're almost ready but in the heat of battle you can't quite remember if you need to reverse the polarity or not.","item":""},{"title":"Kramulon attack","id":"7048","options":[],"text":"\"Ready Captain,\" you call out.\n\"We'll fly right down their throat and rip out their underbelly. Keep those torpedoes off us, Cadet.\"\nYou fire up the sensor array as the ship turns and accelerates directly towards the Kramulons. You send the jamming signal as the aliens fire a barrage of torpedoes.\n\"I hope you remembered to reverse the polarity, Cadet!\"\nWith a sinking feeling, you see all the torpedoes turn and head directly for you. The dark matter torpedo annihilation is almost a relief...","item":"","isEnd":true},{"title":"Kramulon attack","id":"7049","options":[{"text":"Continue","goto":"7050","with":"","without":""}],"text":"\"Ready Captain,\" you call out.\n\"We'll fly right down their throat and rip out their underbelly. Keep those torpedoes off us, Cadet.\"\nYou fire up the sensor array as the ship turns and accelerates directly towards the Kramulons. You send the jamming signal as the aliens fire a barrage of torpedoes.","item":""},{"title":"Kramulon attack","id":"7050","options":[{"text":"Continue","goto":"800","with":"","without":""}],"text":"The Temerarius begins its strafing run while you cause the alien torpedoes go wide. The Kramulon beams are absorbed by your shields. A console explodes in a shower of sparks and the cadet there screams and falls to the floor, dead.\nDesperately, the Kramulon ship tries to evade. \"Fire!\" calls the Captain and your weapons lash out as you pass close to the side of the Kramulons, hitting their warp core. Your ship is buffeted by the explosion of the Kramulon ship as you race past.","item":""},{"title":"Tactical","id":"7051","options":[{"text":"Reduce shield power","goto":"7052","with":"","without":""},{"text":"Raise shields","goto":"7067","with":"","without":""}],"text":"You sit at your console and check the controls - shields at standby ready to be raised in an instant, weapons power cycling ready to be charged for firing. All your lights are green.\nThe ship drops out of warp.\n\"Begin scan of local sector,\" orders the Tactical Officer.\n\"Aye aye, Sir,\" you reply, starting the scan for anything which might be a danger to the ship.\nYou spot an odd reading but it doesn't look right. It could be something or nothing. The shields seem to be interfering with the scan.","item":"Tactical codes"},{"title":"Tactical","id":"7052","options":[{"text":"Raise shields","goto":"7053","with":"","without":""}],"text":"You power the shields down from standby to idle and re-run the scan. That's a lot better - there's definitely some unusual tachyon activity there!\n\"Detecting a transmission,\" calls out the Comms Officer as you study your data. \"From a small probe.\"\nA little red light starts to blink ominously.\n\"Uh...sir? What's this?\"\nThe Tactical Officer glances over and jumps out of his seat, \"Vessel de-cloaking!\" he shouts.\n\"Red alert,\" orders the Captain. \"Raise shields and open hailing frequencies.\"","item":""},{"title":"Tactical","id":"7053","options":[{"text":"Wait for shields","goto":"7054","with":"","without":""},{"text":"Divert power from engines","goto":"7058","with":"","without":""},{"text":"Divert power from weapons","goto":"7060","with":"","without":""}],"text":"You press the button to raise the shields but nothing happens. The indicator shows that they are going to take at least a minute to power up fully from the idle mode you've set them in. You look up and the viewscreen shows a blurry shape that quickly resolves into a dangerous looking spaceship.\n\"Kramulons!\" gasps the Tactical Officer. \"But what are they doing so far from their Empire?\"\nHe looks over at you, \"Cadet! Raise shields now!\"\nYou stab at buttons but nothing happens.","item":""},{"title":"Tactical","id":"7054","options":[{"text":"Open fire","goto":"7055","with":"","without":""},{"text":"Adjust shields","goto":"7057","with":"","without":""}],"text":"\"Shields still powering up.\"\nOn the viewscreen a long-snouted, pink and grey skinned Kramulon is ranting in it's weird piping language. The Captain is trading threats with it.\nThe Tactical Officer looks at your console. \"What have you done?! Why did you power down the shields?\"\n\"They were interfering with the scan.\"\nHe looks at you, aghast, \"The scan showing a heavily-armed Kramulon warship de-cloaking right in front of us?!\"\nAn alarm sounds. \"Kramulon weapons powering up!\" he shouts.","item":""},{"title":"Kramulon attack","id":"7055","options":[{"text":"The emergency protocol!","goto":"7041","with":"Emergency protocol","without":""},{"text":"Continue","goto":"7056","with":"","without":"Emergency protocol"}],"text":"Hurriedly you stab at buttons to fire beams and torpedoes towards the Kramulon ship. The Navigation Officer does her best to evade the incoming fire but without shields, the result is a foregone conclusion.\nConsoles explode in sparks as the Kramulon torpedoes hit. The cadet at the console next to you screams and falls dead as his console explodes.\n\"Engineering has been hit!\" someone yells. The warp core is overloading! We're going to blow!\"","item":""},{"title":"Kramulon attack","id":"7056","options":[],"text":"You press buttons in a panic, doing anything you can to raise the shields or return fire but to no avail. You cause some damage to the Kramulon ship but not enough. A klaxon is blaring above you as the Kramulons launch their final barrage of dark matter torpedoes. Within moments you are beyond caring whether it was the explosion of the quantum warp core or the impact of the torpedoes that wiped you from existence; you're too busy being an expanding cloud of superheated particles.","item":"","isEnd":true},{"title":"Kramulon attack","id":"7057","options":[{"text":"The emergency protocol!","goto":"7041","with":"Emergency protocol","without":""},{"text":"Continue","goto":"7056","with":"","without":"Emergency protocol"}],"text":"Hurriedly you try to divert as much shield power as possible to the front to fend off the Kramulon attack but the result is a foregone conclusion.\nConsoles explode in sparks as the Kramulon torpedoes hit and the shields fail completely. \nAnother wave of Kramulon torpedoes is already on the way.\nThe cadet at the console next to you screams and falls dead as his console explodes.\n\"Engineering has been hit!\" someone yells. The warp core is overloading! We're going to blow!\"","item":""},{"title":"Kramulon attack","id":"7058","options":[{"text":"Open fire","goto":"7059","with":"","without":""},{"text":"Adjust shields","goto":"7057","with":"","without":""}],"text":"The best defence is a shield, obviously. But the next best defence is offence and you can't go on the offensive without weapons, so you leave the weapons alone and attempt to divert power from the engines to the shields.\n\"Lost power to main engines!\" shouts the Navigation Officer. \"We're a sitting duck!\"\nYou manage to get power to the shields and the first wave of Kramulon beams and torpedoes is narrowly survived. Without main engines though, the ship cannot avoid the next wave of torpedoes.","item":""},{"title":"Kramulon attack","id":"7059","options":[{"text":"The emergency protocol!","goto":"7041","with":"Emergency protocol","without":""},{"text":"Continue","goto":"7056","with":"","without":"Emergency protocol"}],"text":"Hurriedly you stab at buttons to fire beams and torpedoes towards the Kramulon ship but without being able to get out of their way of their weapons the result is a foregone conclusion. Some of your weapons hit the Kramulons but your shields fail and the next wave of torpedoes is already on the way.\nThe cadet at the console next to you screams and falls dead as his console explodes.\n\"Engineering has been hit!\" someone yells. The warp core is overloading! We're going to blow!\"","item":""},{"title":"Kramulon attack","id":"7060","options":[{"text":"Continue","goto":"7061","with":"","without":""}],"text":"Reasoning that shields and engines are of more immediate use in surviving the Kramulon assault, you begin to divert power from the weapons. You manage to fire a few torpedoes at the Kramulons but the main weapon is offline while you power up the shields.\nYou manage to get the shields to full power just in time to survive the initial attack with minimal damage, thanks to the shield and evasive manoeuvres by the Navigation Officer.\n\"Where's my main gun?\" demands the Captain. \"Open fire now!\"","item":""},{"title":"Kramulon attack","id":"7061","options":[{"text":"All out attack","goto":"7062","with":"","without":""},{"text":"Ram them","goto":"7065","with":"","without":""}],"text":"\"Main weapon offline, Captain\" reports the Tactical Officer, glaring at you.\n\"Dammit! We can't take too much of this. We need to take them out now!\"\nThe ship rocks as several more torpedoes hit. A console explodes in sparks, killing a cadet nearby.\nThe ship lurches as the Navigation Officer evades more incoming fire.\n\"Uh...Captain,\" you say nervously. \"I think I might have an idea.\"\n\"What is it, Cadet?\"","item":""},{"title":"Kramulon attack","id":"7062","options":[{"text":"Fire!","goto":"7063","with":"","without":""}],"text":"\"Um...I think if we divert all power to the main weapon, we can overload it and get a shot powerful enough to punch through their shields and take them out in one hit.\"\nThe Captain rubs his chiselled jaw in thought. \"I like it. Navigation Officer, plot an attack vector to put one shot right through their ship. Cadet, target their warp core.\"\n\"Target acquired, Captain.\"\n\"We only get one shot at this. If we miss, we're a sitting duck. Can you do this, Cadet?\"\n\"Aye aye Sir.\"\n\"Make it so.\"","item":""},{"title":"Kramulon attack","id":"7063","options":[{"text":"Continue","goto":"7064","with":"","without":""}],"text":"Silence falls throughout the bridge - apart from the sirens, the exploding consoles and the screams of injured crew.\nThe Navigation Officer throws the ship into a manoeuvre that lines up your shot.\nSweating with the tension, you stab at buttons to draw power from all the ship's systems. The lights dim as the main weapon fires. A ferocious beam of unimaginable power lances out and passes within a few feet of the Kramulon ship.\nThe SFV Temerarius drifts defenceless as the Kramulon ship opens fire.","item":""},{"title":"Kramulon attack","id":"7064","options":[],"text":"The Captain puts his head in his hands. \"You're an arse, Cadet.\"\nIn a panic you press buttons, desperately trying to return some power to the shields or engines. Nothing - no shields, no engines, no weapons, no life support and the lights are fading. Even the viewscreen powers down so you don't see the beam that stabs out from the Kramulon ship and pierces the quantum warp core or the final volley of dark matter torpedoes that blows the SFV Temerarius into radioactive dust.","item":"","isEnd":true},{"title":"Kramulon attack","id":"7065","options":[{"text":"Continue","goto":"7066","with":"","without":""}],"text":"\"Sir, only our main weapon is powerful enough to penetrate their shields. We can batter them with torpedoes but we are running out of time. I think we should fly straight at them.\"\nThe Captain raises an eyebrow. \"I like a suicidal charge as much as the next man but I was hoping to survive to complete our mission.\"\n\"If we get close enough, I think I can phase modulate our shields to disrupt theirs long enough to fire torpedoes while maintaining our shields. We'll have to be REALLY close though.\"","item":""},{"title":"Kramulon attack","id":"7066","options":[{"text":"Continue","goto":"800","with":"","without":""}],"text":"The Captain strokes his chiselled chin in thought. \"I like it. Make it so, Cadet.\" \nAs you adjust your shields, the ship accelerates towards the Kramulon vessel.  Consoles explode in sparks and a cadet screams and falls dead as the two shields clash together. The ship groans with the stress but the Kramulon shield goes down.\n\"Fire!\" yells the Captain and you launch torpedoes. Your torpedoes hit their warp core and their ship becomes a rapidly expanding cloud of debris as you race past.","item":""},{"title":"Tactical","id":"7067","options":[{"text":"Analyse ship","goto":"7068","with":"","without":""},{"text":"Analyse weapons","goto":"7088","with":"","without":""}],"text":"As you raise the shield power from standby to ready status, the Tactical Officer calls out, \"Vessel de-cloaking!\"\nThe viewscreen shifts view to a blurry patch of space which rapidly resolves into a deadly-looking spaceship.\n\"Kramulons!\" gasps the Tactical Officer. \"What are they doing so far from their empire?\"\n\"Red alert,\" orders the Captain. \"Raise shields and open hailing frequencies.\"\nYou raise the shields to full power and begin to power up the weapons as you scan the Kramulon ship.","item":""},{"title":"Tactical","id":"7068","options":[{"text":"Warp core","goto":"7069","with":"","without":""},{"text":"Engines","goto":"7070","with":"","without":""},{"text":"Weapons","goto":"7078","with":"","without":""}],"text":"With the shields powered up and the weapons ready to fire, you have the time to scan the Kramulon ship looking for weak points to attack if it comes to a battle - and with Kramulons involved, that's almost a certainty.\nYou glance up at the viewscreen where a long-snouted grey-pink skinned Kramulon is beating its fist on its scale armour and ranting in its weird piping language, trading threats with the Captain. Things seem to be escalating, you should choose a target on the Kramulon ship.","item":""},{"title":"Tactical","id":"7069","options":[{"text":"Target engines","goto":"7071","with":"","without":""},{"text":"Fire again","goto":"7074","with":"","without":""}],"text":"You programme a firing solution to target the Kramulon warp core. With that gone their ship will either explode or be left completely helpless.\nAfter more shouting, the Kramulon warrior disappears from the screen. \"Kramulon weapons powering up,\" calls the Tactical Officer.\n\"Evasive manoeuvres, open fire,\" orders the Captain.\nYou stab the button that fires the main weapon directly at the Kramulon warp core. The beam is absorbed by the Kramulon shield, doing only minor damage. What now?","item":""},{"title":"Kramulon attack","id":"7070","options":[{"text":"Fire again","goto":"7082","with":"","without":""},{"text":"Target weapons","goto":"7083","with":"","without":""}],"text":"You programme a firing solution to target the Kramulon engines. With them gone their ship will be unable to manoeuvre and will be forced to surrender.\nAfter more shouting, the Kramulon warrior disappears from the screen. \"Kramulon weapons powering up,\" calls the Tactical Officer.\n\"Evasive manoeuvres, open fire,\" orders the Captain.\nYou stab the button that fires the main weapon directly at the Kramulon engines. The beam is absorbed by the Kramulon shield, doing only minor damage. What now?","item":""},{"title":"Kramulon attack","id":"7071","options":[{"text":"All out attack","goto":"7072","with":"","without":""},{"text":"Ram them","goto":"7073","with":"","without":""}],"text":"You launch a spread of torpedoes as the Navigation Officer moves the ship into a better position for aiming at the Kramulon engines. The alien particle beam splashes against your shields and their dark matter torpedoes hit, causing damage to the ship. A console explodes in shower of sparks, killing the cadet sitting at it. You fire at the Kramulon engines but the power is mostly absorbed by their shield.\n\"We need to take them out now!\" demands the Captain.\nWhat now?","item":""},{"title":"Kramulon attack","id":"7072","options":[{"text":"Explain","goto":"7062","with":"","without":""}],"text":"More torpedoes hit. The power of your shields is now down to 62% and the ship is taking damage. This can't go on for much longer. You check your scans of the Kramulon ship and an idea occurs to you - all you need is one decent hit on their warp core. You could continue to batter each other's shields with torpedoes and hope theirs runs out first but if the main weapon could be given more power it might get through their shields. It's risky though.\n\"Captain, I have an idea!\"\n\"What is it Cadet?\"","item":""},{"title":"Kramulon attack","id":"7073","options":[{"text":"Explain","goto":"7065","with":"","without":""}],"text":"More torpedoes hit. The power of your shields is now down to 62% and the ship is taking damage. This can't go on for much longer. You check your scans of the Kramulon ship and an idea occurs to you - if you can take their shields down, you can destroy their warp core with torpedoes. It's risky though - you'll need to be close. The other option is to divert power from engines and shields to the main weapon, but what sort of idiot would do that?\n\"Captain, I have an idea!\"\n\"What is it Cadet?\"","item":""},{"title":"Kramulon attack","id":"7074","options":[{"text":"Shields","goto":"7075","with":"","without":""},{"text":"Engines","goto":"7071","with":"","without":""}],"text":"You fire at their warp core but their shields are too powerful and you aren't doing enough damage to disable or destroy them. Trading indecisive shots like this is going to get your ship destroyed. Another spread of Kramulon torpedoes is already on the way and your shields are already straining.\nYou need to either disable their engines, making them an easy target or disable their shields, leaving them defenceless. But which?","item":""},{"title":"Kramulon attack","id":"7075","options":[{"text":"Normal polarity","goto":"7076","with":"","without":""},{"text":"Reverse polarity","goto":"7077","with":"","without":""}],"text":"The ship lurches as the Navigation Officer tries to evade more incoming fire. Quickly you check your scans of the Kramulon ship and an idea occurs to you. If you use modified tachyons to augment the main weapon, you might be able to disrupt their shields and leave them vulnerable to a volley of torpedoes.\nQuickly you programme the main weapon but you're too flustered to be sure whether you need to reverse the polarity of the modified tachyon flow or not.","item":""},{"title":"Kramulon attack","id":"7076","options":[],"text":"There's no time to reverse the polarity. You need to fire, now!\nYou stab the fire button and a stream of modified tachyons joins the main weapon. The Kramulon shield blazes under the attack but holds. More consoles around you explode as the feedback from the beam shakes the ship to its core. Sparks fly and circuit breakers break. The lights go off, the your shields fail and the ship powers down. You barely have time to say, \"Oops.\" before the Kramulon torpedoes annihilate your ship.","item":"","isEnd":true},{"title":"Kramulon attack","id":"7077","options":[{"text":"Continue","goto":"800","with":"","without":""}],"text":"Quickly you reverse the polarity and feed the stream of modified tachyons into the main weapon.  It lashes out and crashes against the Kramulon shield, which flares into nothingness.\n\"Kramulon shields down!\" calls the Tactical Officer.\n\"Target warp core. Fire!\" orders the Captain.\nYou fire a volley of torpedoes. The defenceless Kramulon ship tries to evade but your torpedoes fly true and their warp core is destroyed, exploding and taking the Kramulon ship with it in a hellish nuclear fury.","item":""},{"title":"Kramulon attack","id":"7078","options":[{"text":"Main weapon","goto":"7079","with":"","without":""},{"text":"Engines","goto":"7079","with":"","without":""}],"text":"You programme a firing solution to target the Kramulon weapons. Without them they won't be able to attack you and will be forced to surrender.\n\"Kramulon weapons powering up,\" calls the Tactical Officer.\n\"Evasive manoeuvres, open fire,\" orders the Captain.\nYou stab the button that fires the main weapon directly at the Kramulon torpedo bays. A fortuitous shot as their shield opens to fire lets you hit an emerging torpedo, doing major damage to the Kramulons. What's your next target?","item":""},{"title":"Kramulon attack","id":"7079","options":[{"text":"Shields","goto":"7080","with":"","without":""},{"text":"Engines","goto":"7081","with":"","without":""}],"text":"You line up your next shot. The Kramulons aren't firing their particle beam so you must have damaged their weapon controls.\n\"Kramulons on collision course!\" shouts the Navigation officer. \"They're going to ram us!\"\nWeaponless, the Kramulons have opted for a suicide attack. They accelerate towards you at a frightening speed.\n\"Evasive manoeuvres, power to front shields,\" orders the Captain.\nYou need to divert power now - but where to?","item":""},{"title":"Kramulon attack","id":"7080","options":[],"text":"As the Kramulon ship rushes towards you, you divert all power to the shields. The Navigation Officer tries to evade but you've just put most of her power into the shields.\n\"Engines not responding, Captain! They're going to hit us!\"\n\"They're overloading their warp core!\" shouts someone else.\nThe alien ship crashes into you, both shields flaring violently. Your console explodes, killing you an instant before the exploding Kramulon warp core reduces both ships to a radioactive cloud.","item":"","isEnd":true},{"title":"Kramulon attack","id":"7081","options":[],"text":"Even with full power to the shields, a collision between the two ships would be catastrophic. You divert all available power to the engines, praying that the Navigation Officer can outmanoeuvre the Kramulon vessel.\n\"They're overloading their warp core!\" someone shouts.\nThe Kramulon vessel passes mere metres from your ship. Their warp core explodes and at such close range and without shields, the explosion ignites your own warp core and the Temerarius is also reduced to radioactive dust.","item":"","isEnd":true},{"title":"Kramulon attack","id":"7082","options":[{"text":"Divert power","goto":"7084","with":"","without":""}],"text":"You launch an array of torpedoes at the Kramulon engines. Their shield takes a battering but holds. You follow up with a shot from the main weapon which punches through the weakened Kramulon shield and you whoop as you see the explosion from one of their engines.\n\"Torpedoes incoming!\"\nThe partially crippled Kramulon vessel has fired all their remaining torpedoes. The Navigation Officer does her best to evade but there are too many of them.","item":""},{"title":"Kramulon attack","id":"7083","options":[{"text":"Main weapon","goto":"7079","with":"","without":""},{"text":"Warp core","goto":"7079","with":"","without":""}],"text":"You stab the button that fires the main weapon directly at the Kramulon torpedo bays. A fortuitous shot as their shield opens to fire lets you hit an emerging torpedo, doing major damage to the Kramulons. What's your next target?","item":""},{"title":"Kramulon attack","id":"7084","options":[{"text":"Shields","goto":"7085","with":"","without":""},{"text":"Engines","goto":"7086","with":"","without":""},{"text":"Weapons","goto":"7087","with":"","without":""}],"text":"Several torpedoes hit and the ship is rocked by explosions.  A cadet nearby screams and falls dead to the floor, burnt to a crisp as her console explodes in a shower of sparks. Shields are down to 37% and another wave of torpedoes is incoming. You don't have enough power for everything. You need to divert some power now, to save the ship. But where?","item":""},{"title":"Kramulon attack","id":"7085","options":[{"text":"Continue","goto":"800","with":"","without":""}],"text":"Desperately you divert all available power to the shields.\nThe torpedoes hit and the ship lurches at the impacts. Shields are down and the ship has taken damage but survived.\nThe Captain's face turns grim. No Kramulon has ever surrendered, they always fight to the death.\n\"Finish them.\"\nYou fire a volley of torpedoes at the crippled ship, destroying their shields. You have just enough power for one final shot from the main weapon, striking the warp core of the Kramulon vessel, disintegrating it.","item":""},{"title":"Kramulon attack","id":"7086","options":[],"text":"Desperately you divert all power to the main engines, praying that the Navigation Officer can evade enough of the incoming dark matter torpedoes to save the ship. You grip tight to your console and the ship groans under the strain of the thrust. A torpedo hits and sparks fly. Shields are down to 3%. Another hit! One of the main engines fails. There are too many torpedoes and with no shields left, the outcome is inevitable. A torpedo strikes the warp core and the ship is instantly vapourised.","item":"","isEnd":true},{"title":"Kramulon attack","id":"7087","options":[],"text":"Desperately you divert power to the main weapons and open fire, trying to take out as many of the incoming torpedoes as possible. A torpedo hits and sparks fly. Shields are down to 3%. The Navigation Officer tries to evade but there isn't enough power to the engines.\nAnother hit! One of the main engines fails. There are too many torpedoes and with no shields left, the outcome is inevitable. A torpedo strikes the warp core and the ship is instantly vapourised.","item":"","isEnd":true},{"title":"Tactical","id":"7088","options":[{"text":"Main weapon","goto":"7089","with":"","without":""},{"text":"Torpedo bays","goto":"7090","with":"","without":""}],"text":"With the shields powered up and the weapons ready to fire, you have the time to scan the Kramulon ship looking for weak points to attack if it comes to a battle - and with Kramulons involved, that's almost a certainty.\nYou glance up at the viewscreen where a long-snouted grey-pink skinned Kramulon is beating its fist on its scale armour and ranting in its weird piping language, trading threats with the Captain. Things seem to be escalating, you should choose a target on the Kramulon ship.","item":""},{"title":"Kramulon attack","id":"7089","options":[{"text":"Target engines","goto":"7071","with":"","without":""},{"text":"Target torpedoes","goto":"7083","with":"","without":""}],"text":"You programme a firing solution to target the Kramulon main weapon. Without it they'll be reduced to torpedoes, which are easier to evade or shoot down.\nAfter more shouting, the Kramulon warrior disappears from the screen. \"Kramulon weapons powering up,\" calls the Tactical Officer.\n\"Evasive manoeuvres, open fire,\" orders the Captain.\nYou stab the button that fires the main weapon directly at the Kramulon weapon. Your beam is absorbed by the Kramulon shield, doing only minor damage. What now?","item":""},{"title":"Kramulon attack","id":"7090","options":[{"text":"Fire again","goto":"7083","with":"","without":""},{"text":"Target engines","goto":"7071","with":"","without":""}],"text":"You programme a firing solution to target the Kramulon torpedo bay. Without torpedoes they'll only have a particle beam, which is easier to deflect with shields.\nAfter more shouting, the Kramulon warrior disappears from the screen. \"Kramulon weapons powering up,\" calls the Tactical Officer.\n\"Evasive manoeuvres, open fire,\" orders the Captain.\nYou stab the button that fires the main weapon at the Kramulon torpedo bay. Your beam is absorbed by their shield, doing only minor damage. What now?","item":""},{"title":"Uncharted Zone","id":"800","options":[{"text":"Scan for transmissions","goto":"802","with":"Comms access","without":""},{"text":"Warp drive","goto":"803","with":"Navigation codes","without":""},{"text":"Scan for Kramulons","goto":"804","with":"Tactical codes","without":""},{"text":"Tea break","goto":"801","with":"","without":""}],"text":"You breathe a sigh of relief as the Captain orders the stand-down from red alert.\nMedical and engineering staff come onto the bridge to help the injured and repair exploded consoles.\n\"Good work, crew,\" says the Captain. \"Scan for other Kramulon vessels, bring the warp drives back on line just in case and see if we can find that probe.\"\n","item":""},{"title":"Bridge","id":"801","options":[],"text":"You look around but everyone is busy. After single-handedly saving the ship like that, you feel you deserve a break. In the bustle of engineers using their laser wrenches and burnt cadets being carried out on stretchers nobody notices you leave your console.\n\"Tea, Earl Grey, hot,\" you order.\nA klaxon blares on the bridge. \"WARNING! Critical power cascade failure!\"\nYour tea is the last straw for the damaged ship. The resulting power failure collapses the warp core and disintegrates the ship.","item":"","isEnd":true},{"title":"Bridge","id":"802","options":[{"text":"Follow","goto":"805","with":"","without":""}],"text":"You scan for transmissions again, finding the probe. You also review the logs from the battle with the Kramulons. There is no indication that they broadcast a distress call or attempted to contact any other Kramulon vessels for backup.\n\"Captain, the probe is transmitting from the fourth planet of this system. The Kramulon ship sent no transmissions during the battle so they must have been out here alone.\"\n\"Good work, Cadet. Let's find out why they were here. Cadet, you're with me.\"","item":""},{"title":"Bridge","id":"803","options":[{"text":"Follow","goto":"805","with":"","without":""}],"text":"You check the warp drives and bring them to standby, plotting an emergency course in the event that more Kramulons arrive.\n\"No sign of other Kramulon vessels, Captain\" reports the Tactical Officer.\n\"The probe is transmitting from the fourth planet Sir\" reports Comms.\n\"Warp drives on standby and escape route plotted, Captain.\" \n\"Thank you, Cadet. Now let's find out why the Kramulons were here. Cadet, you're with me.\"\n","item":""},{"title":"Bridge","id":"804","options":[{"text":"Follow","goto":"805","with":"","without":""}],"text":"You scan the local system for signs of other Kramulon ships or a base. You also scan the local sector for signs of warp drives. Nothing, unless they're cloaked.\n\"No signs of other Kramulons, Captain.\"\n\"Thank you, Cadet.\"\n\"Sir, I've located the probe,\" reports Comms. \"It's on the fourth planet.\"\n\"Okay. Let's find out why the Kramulons were here. Cadet, you're with me.\"","item":""},{"title":"Transporter room","id":"805","options":[{"text":"\"Ready\"","goto":"806","with":"","without":""},{"text":"\"Uh...Captain?\"","goto":"807","with":"","without":""}],"text":"You follow the Captain to the transporter room where you are joined by the head of Security, the Medical Officer, the Science Officer and several other cadets in red shirts.\n\"We're going to beam down and investigate that probe,\" says the Captain. \"See if we can find out what the Kramulons were so interested in that they've travelled halfway across the galaxy to find it.\"\nNervously you check that your phaser is in its holster and step onto a teleporter pad.\n\"Ready?\" askes the Captain.","item":""},{"title":"Thargon IV","id":"806","options":[],"text":"Sparkly lights envelope you and the view of the teleporter room changes to one of the surface of a rocky planet. As the sparkly lights vanish the crew start to draw their phasers and turn to look at their surroundings. You have landed near a Kramulon probe.\n\"Kramulons!\" shouts the head of Security. You turn but you're too late. Your phaser is only half out of its holster when a Kramulon blaster beam hits you in the chest, punching a hole the size of a fist where your heart used to be.","item":"","isEnd":true},{"title":"Transporter room","id":"807","options":[{"text":"Teleport","goto":"808","with":"","without":""}],"text":"\"Uh...Captain,\" you pipe up nervously. \"I can't help noticing that we are all standing facing the same way with our phasers holstered.\"\n\"That's standard protocol,\" replies the head of Security.\n\"What's your point, Cadet?\" asks the Captain.\n\"If we're beaming down to an unknown, possibly hostile location, shouldn't we be in a circle with our phasers out, ready to react and watching each others' backs?\"\n\"Good idea. Let's make that standard protocol from now on.\"","item":""},{"title":"Thargon IV","id":"808","options":[{"text":"Keep firing","goto":"809","with":"","without":""},{"text":"Find cover","goto":"813","with":"","without":""}],"text":"You draw your phaser and the group assembles facing outwards and ready for anything.\nSparkly lights envelop you and your view changes to the surface of a rocky planet. You have landed near a Kramulon probe, a small prefabricated hut and the entrance to a cave.\n\"Kramulons!\" shouts the head of Security. You dive to the side as a Kramulon blaster beam hits the cadet next to you, punching a hole the size of a fist where his heart used to be. You return fire and one of the Kramulons collapses.","item":""},{"title":"Thargon IV","id":"809","options":[{"text":"Shoot Kramulon","goto":"811","with":"","without":""},{"text":"Warn Captain","goto":"810","with":"","without":""}],"text":"You continue to return fire, forcing the remaining Kramulon to duck behind the probe. With you and the others covering him, the head of Security manages to flank the Kramulon and with a well placed phaser bolt, he burns the Kramulon's legs off. The Kramulon warrior drops his blaster and falls to the ground screaming in pain.\nAs the Captain approaches the wounded Kramulon to interrogate him. You see the Kramulon reach into his belt for something. Maybe a Kramulon gutting knife!","item":""},{"title":"Thargon IV","id":"810","options":[],"text":"\"Watch out!\" you yell, running towards the Captain and throwing him out of harm's way. The head of security drops to a wary crouch, phaser weaving back and forth looking for the source of danger.\nThe Kramulon laughs evilly. As you look over you see something in his hand. A detonator!\n\"No!\" you shout as the dying Kramulon presses the button.\nThe nuclear engine in the probe is only small but the explosion from it is large enough to destroy everything within a two mile radius, which includes you.","item":"","isEnd":true},{"title":"Kramulon probe","id":"811","options":[{"text":"Inside hut","goto":"815","with":"","without":""},{"text":"Behind rocks","goto":"812","with":"","without":""},{"text":"Cave","goto":"816","with":"","without":""}],"text":"\"Watch out!\" you yell as you fire your phaser at the wounded Kramulon. The Captain dives aside and the Kramulon collapses dead on the ground.\nThe Captain gets to his feet and dusts himself off. \"What did you do that for, Cadet?\"\n\"Sir, look,\" says the head of Security. He's holding up a detonator dropped by the Kramulon. \"He could have blown us all to smithereens.\"\n\"Well done, Cadet. OK people, spread out and make sure there are no more Kramulons about.\"\nWhere do you look?","item":""},{"title":"Thargon IV","id":"812","options":[{"text":"Investigate","goto":"814","with":"","without":""}],"text":"You spot a rocky outcrop. Anything could be hiding there! It's definitely worth checking out.\nYou pass the Medical Officer examining the hole in the other cadet's chest. With a look of anguish on his face he turns to the Captain and shakes his head. \"He's dead, Jim.\"\n\"It could have been worse if we hadn't been ready for the attack,\" replies the Captain.\nYou step round the dead body, trying to see what's behind the rocky outcrop. You think you hear a noise so you step behind it to investigate.","item":""},{"title":"Thargon IV","id":"813","options":[{"text":"Hide","goto":"814","with":"","without":""},{"text":"Return fire","goto":"809","with":"","without":""}],"text":"You continue returning fire but you're feeling exposed and can't get a clear shot at the Kramulon. You spot a rocky outcrop. That would be a great place to take cover and might even give you a clearer shot at the Kromulan hiding behind the probe. You fire two more rapid phaser shots and the Kromulan ducks. You take your chance and sprint for the rocky outcrop. The Kramulon spots you trying to get round behind him and fires his blaster at you.","item":""},{"title":"Rocky outcrop","id":"814","options":[],"text":"As you move behind the rocks, you hear a loud roar. A large stone hits your wrist, making you drop your phaser. You drop into the Space Fleet approved hand-to-hand fighting stance as a large green monster bristling with claws and teeth ambles towards you.\nThe others, having dispatched the Kramulon, come running at your agonised screams but it is too late. By the time the Captain appears and is tearing his shirt off ready for combat, the monster is already wearing your entrails as a necklace.","item":"","isEnd":true},{"title":"Hut","id":"815","options":[{"text":"Run to help","goto":"820","with":"","without":""}],"text":"With your phaser out and ready in case another Kramulon is inside, you kick open the door of the hut and the flimsy structure collapses into a heap. You kick through the debris. There's nothing except a few Kramulon food bars - completely inedible to humans - and a Kramulon power cell.\nAs you turn to rejoin the group, you hear an agonised scream from behind the rocky outcrop.","item":"Kramulon power cell"},{"title":"Cave entrance","id":"816","options":[{"text":"Shoot it again","goto":"817","with":"Phaser upgrade","without":""},{"text":"Shoot it again","goto":"818","with":"","without":"Phaser upgrade"},{"text":"Run","goto":"819","with":"","without":""}],"text":"You gesture to another red-shirted cadet to come with you and the two of you approach the cave carefully. It's dark and you squint inside, trying to make out if anything is in there. You both step back, readying your phasers at the sound of a loud roar. A large stripy creature, bristling with fangs and spikes stumbles towards you from the cave.\nBoth you and the other cadet fire your phasers at the rapidly advancing creature. It roars in pain but shrugs off the beams.","item":""},{"title":"Cave entrance","id":"817","options":[{"text":"Run to help","goto":"820","with":"","without":""}],"text":"The creature grabs the other cadet by the head and rips it clear of his body, dragging his spine out with it.\nYou remember your upgraded phaser powerpack and change the setting to overload. As the creature advances towards you, you fire. This time it screams and falls to its knees, wounded. You fire again. And again. Finally it collapses, dead and smouldering gently.\nAs you turn to rejoin the group, you hear an agonised scream from behind the rocky outcrop.","item":""},{"title":"Cave entrance","id":"818","options":[],"text":"The creature grabs the other cadet by the head and rips it clear of his body, dragging his spine out with it.\nGibbering with fear, you fire your phaser again and again with little discernible effect as the creature advances inexorably towards you. You scream in agony as the creature grabs your arm and tears it off.\nBy the time the rest of the away team run towards your screams, your head is already a smashed pulp as the creature beats you to death with the wet end of your arm.\n","item":"","isEnd":true},{"title":"Cave entrance","id":"819","options":[],"text":"The creature grabs the other cadet by the head and rips it clear of his body, dragging his spine out with it.\nYou scream and run. Suddenly you are flying through the air, tripped by the spine and guts of your crewmate that the monster has thrown at you. You roll onto your back, desperately trying to aim your phaser but the creature is on you, fangs already ripping you apart. As the blackness closes in you see it chewing on your freshly removed heart and reaching for your liver.","item":"","isEnd":true},{"title":"Rocky outcrop","id":"820","options":[{"text":"Continue","goto":"821","with":"","without":""}],"text":"You run towards the screams. The Captain is there, with his shirt off for some reason, wrestling with a large, green monster. There is a dead cadet on the floor, his torn red shirt masking some of the copious amounts of his blood splattered about. With a grunt, the Captain twists and the creature's neck snaps. He drops the corpse to the floor. A single strand of hair is out of place on his forehead and he has three manly looking slashes across his chest from the monster.","item":""},{"title":"Cave entrance","id":"821","options":[{"text":"Flower","goto":"822","with":"","without":""},{"text":"Control panel","goto":"823","with":"","without":""},{"text":"Door","goto":"826","with":"","without":""}],"text":"The Captain leads the away team to the cave entrance. \"There's nothing else close by so the Kramulons must have  been investigating this. Let's see what they looking for.\nSuddenly there is a loud roar and a stripy, fanged creature lumbers from the cave. The entire away team fire their phasers. It resists but the concentration of fire is too much and it drops to the ground, smouldering.\nYou enter the cave. There is a large door, an odd-looking flower and a control panel. What do you look at?","item":""},{"title":"Cave entrance","id":"822","options":[],"text":"You kneel to inspect the odd flower. As you smell it, small filaments spring from it and spear your chest. You cry out in agony. More filaments leap out from the carnivorous plant and wrap themselves round you. You scream as you feel them constricting and the razor thin filaments slice off your limbs. You're still alive as the plant slices you in half and begins to digest you.\nYou're too busy screaming to be able to beg for death and the phaser shot from the head of Security is a blessed relief.","item":"","isEnd":true},{"title":"Cave entrance","id":"823","options":[{"text":"Press green button","goto":"824","with":"","without":""},{"text":"Press red switch","goto":"825","with":"","without":""}],"text":"You take a closer look at the control panel set into the rocky wall of the cave. It looks ancient. Parts of it have rusted away but it looks like there is still some power coming to it from somewhere. A red switch blinks in the centre of panel and you think you can detect a faint glow coming from a green button further down.","item":""},{"title":"Cave entrance","id":"824","options":[],"text":"\"Cadet, no!\" yells the Science Officer as you press the green button.\n\"What?\" you ask.\nEveryone falls into silence for a moment but nothing happens.\n\"Don't touch anything else,\" instructs the Science Officer.\nSuddenly a large door slams down, sealing the cave and an alien voice echoes through the chamber. It takes your wrist computer a few seconds to translate. \"Decontamination in 3...2...1\"\nThere is a bright flash and an instant later the cave is empty except for several scorched piles of dust.","item":"","isEnd":true},{"title":"Cave entrance","id":"825","options":[{"text":"Go through door","goto":"827","with":"","without":""}],"text":"\"Cadet, no!\" yells the Science Officer as you press the red switch.\n\"What?\" you ask.\nEveryone falls into silence for a moment but nothing terrible happens. There is a quiet beep and the door leading further in swings open.\n\"Well I wasn't expecting that,\" says the Captain. The other red-shirted cadets breathe sighs of relief.\n\"Don't touch anything else,\" instructs the Science Officer.\n\"Let's go,\" says the Captain, striding through the open doorway and further into the cave system.\n","item":""},{"title":"Cave entrance","id":"826","options":[{"text":"Follow","goto":"827","with":"","without":""}],"text":"You inspect the door. The Science Officer is scanning it with his tricorder. \"No locks, no sensors, no power source. How do we get it open?\"\n\"There's a handle here...\" you say but get ignored.\n\"I could try overloading my phaser power pack and blow it open.\" says the head of Security.\n\"If we shoot it here, here and here, the resonance feedback might shatter it.\"\nYou reach for the handle and swing the door open.\n\"Let's go,\" says the Captain, striding through the doorway and further into the cave.","item":""},{"title":"Caves","id":"827","options":[{"text":"Go left","goto":"828","with":"","without":"Useless map"},{"text":"Go right","goto":"829","with":"","without":""},{"text":"Go forward","goto":"830","with":"","without":""},{"text":"Go left","goto":"835","with":"Useless map","without":""}],"text":"You are standing in the entrance to the cave system. paths lead away from you in three directions. One path leads directly ahead, one slopes up slightly to the left and the other slopes downwards to the right.","item":""},{"title":"Caves","id":"828","options":[{"text":"Upwards","goto":"834","with":"","without":"Strange crystal"},{"text":"Downwards","goto":"827","with":"","without":""},{"text":"Doorway","goto":"836","with":"","without":""},{"text":"Upwards","goto":"841","with":"Strange crystal","without":""}],"text":"You follow the corridor a short way and it widens out into a large room. There doesn't appear to be anything interesting here, it just seems to be a natural chamber. There is a path leading upwards slightly, a path heading downwards slightly and a doorway half filled with rubble.","item":""},{"title":"Caves","id":"829","options":[{"text":"Upwards","goto":"827","with":"","without":""},{"text":"Downwards","goto":"837","with":"","without":""}],"text":"You follow the path a short way to find a chamber carved out of the rock. there is a path leading upwards or a path leading downwards.","item":""},{"title":"Caves","id":"830","options":[{"text":"Check chamber","goto":"838","with":"","without":"Spear"},{"text":"Crawl through tunnel","goto":"834","with":"","without":""},{"text":"Back to entrance","goto":"827","with":"","without":""},{"text":"Inspect hole","goto":"839","with":"","without":""},{"text":"Check chamber","goto":"863","with":"Spear","without":""}],"text":"You find yourself in a slightly widened section of corridor. There is a small alcove with an opening. It might be a well or it might be a way deeper into the caves. At one end the corridor leads back to the cave entrance and at the other it opens out into a chamber. At one side of the corridor, the ceiling is low over what looks like a narrow tunnel just about big enough to crawl through.\nWhere next?","item":""},{"title":"Collapsed room","id":"831","options":[],"text":"You try to remove some of the rubble but it's too large and heavy. You try your communicator but there's no signal.\nPerhaps you can melt the rocks with your phaser and escape?\nYou turn the phaser to full power and fire at the rubble. It's working! The rocks begin to glow and melt.\nThe power pack on the phaser runs out and the rocks harden again, melted together and blocking the doorway even more effectively. You run out of oxygen long before the away team can clear the rubble to rescue you.","item":"","isEnd":true},{"title":"Collapsed room","id":"832","options":[{"text":"Continue","goto":"835","with":"","without":""}],"text":"You try your communicator but there is no signal. You remember the spork you picked up in the ship's mess. The titanium-iridium spork is strong enough not to break and adds just enough leverage for you to move the nearest rock. Now you've made a start, the next rock is easier to move.\nYou're dangerously short on oxygen by the time you finish but with you digging and the away team digging from the other side, it only takes an hour or so to break free and crawl out of the collapsed room.","item":""},{"title":"Collapsed room","id":"833","options":[],"text":"The rubble is too large and heavy to move, so you sit and wait for the away team to dig you out.\nAfter an hour or so, you are finding it hard to breathe and realise you are running out of oxygen. You shout for help but that just causes more rocks to collapse, crushing your legs.\nIt's a race between your injuries and suffocation to see what kills you first. Both have ample time to do so before the away team finally clears the rubble.","item":"","isEnd":true},{"title":"Caves","id":"834","options":[{"text":"Downwards","goto":"828","with":"","without":"Useless map"},{"text":"Crawl through tunnel","goto":"830","with":"","without":""},{"text":"Investigate doorway","goto":"840","with":"","without":""},{"text":"Ignore doorway","goto":"844","with":"","without":""},{"text":"Downwards","goto":"835","with":"Useless map","without":""}],"text":"You find yourself in a large room that has been crudely hacked from the rock. From the odd shape it looks like it must have been mined of something and left in the shape revealed by whatever had been removed.\nThere is a slope leading downwards, a doorway and a low tunnel, just about big enough to crawl through.","item":""},{"title":"Caves","id":"835","options":[{"text":"Upwards","goto":"834","with":"","without":"Strange crystal"},{"text":"Downwards","goto":"827","with":"","without":""},{"text":"Upwards","goto":"841","with":"Strange crystal","without":""}],"text":"You follow the corridor a short way and it widens out into a large room. There doesn't appear to be anything interesting here, it just seems to be a natural chamber. There is a path leading upwards slightly, a path heading downwards slightly and an impassible doorway filled with rubble.\nWhere now?","item":""},{"title":"Caves","id":"836","options":[{"text":"Use phaser","goto":"831","with":"","without":""},{"text":"Dig","goto":"832","with":"Titanium-iridium spork","without":""},{"text":"Wait for rescue","goto":"833","with":"","without":""}],"text":"\"I'll check in there Captain,\" you volunteer.\nYou step through the doorway and look around. There are no other exits but you spot something on the floor. You move further into the room to retrieve it. It looks like a map but it's torn, faded and impossible to tell what it's a map of. As you turn to leave, the room starts rumbling and shaking. You're knocked to the ground as part of the ceiling collapses. When the dust clears you can see that rubble is blocking the doorway. You're trapped!\n","item":"Useless map"},{"title":"Caves","id":"837","options":[{"text":"Investigate elevator","goto":"847","with":"","without":"Strange crystal"},{"text":"Put hand in hole","goto":"842","with":"","without":""},{"text":"Investigate elevator","goto":"851","with":"Strange crystal","without":""},{"text":"Go back","goto":"829","with":"","without":""}],"text":"You find yourself in a roughly circular chamber. The room is featureless except for a caged chamber at one end that looks like an elevator and a suspicious-looking hole in the wall next to it that is about big enough to put a hand in.","item":""},{"title":"Caves","id":"838","options":[{"text":"Retreat","goto":"849","with":"","without":""},{"text":"Climb down","goto":"843","with":"","without":""},{"text":"Fire phaser","goto":"848","with":"","without":""}],"text":"The cave opens out onto a wide balcony. As you approach the edge you can see into the depths. There are crystals sparkling as far as the eye can see.\n\"Floravian crystals!\" gasps the Science Officer, scanning the cave below with his tricorder. \"The most valuable substance in the universe!\"\n\"This must be what the Kramulons were looking for,\" says the Captain. \"We need to find a way down there.\"\nYou hear a roar from below and see a large hairy creature throwing a spear towards you all.","item":""},{"title":"Caves","id":"839","options":[],"text":"Carefully you approach the hole. Something seems to be glimmering down there. You edge closer, trying to get a closer look. The ground beneath your feet crumbles and gives slightly. \"Crap!\" you exclaim, dropping your phaser down the hole as you try to keep your balance. You reach to grab your phaser and the whole section of floor gives way.\nYou plummet to your death hundreds of feet below, impaled on the most beautiful crystal you've ever seen.","item":"","isEnd":true},{"title":"Small room","id":"840","options":[{"text":"Fire phaser","goto":"846","with":"","without":""},{"text":"Jam mechanism","goto":"845","with":"Titanium-iridium spork","without":""},{"text":"Try door","goto":"850","with":"","without":""}],"text":"Carefully you step through the doorway and inspect the room.\n\"It's a dead end...hang on, there's something here.\"\nYou see a strangely-shaped fragment of crystal glowing on the floor. As you pick it up there is a rumbling and a door slides across, trapping you inside. The rumbling gets louder and the ceiling starts to descend. You've only got seconds before it crushes you!","item":"Strange crystal"},{"title":"Caves","id":"841","options":[{"text":"Downwards","goto":"828","with":"","without":"Useless map"},{"text":"Crawl through tunnel","goto":"830","with":"","without":""},{"text":"Downwards","goto":"835","with":"Useless map","without":""}],"text":"You find yourself in a large room that has been crudely hacked from the rock. From the odd shape it looks like it must have been mined of something and left in the shape revealed by whatever had been removed.\nThere is a slope leading downwards, a low tunnel just about big enough to crawl through and a doorway blocked by rock and the dead body of a cadet.\nWhere now?","item":""},{"title":"Caves","id":"842","options":[],"text":"Nervously you place your hand in the hole, feeling around for some sort of mechanism that will allow you to access the elevator.\nYou scream as you feel several pairs of fangs piercing your hand and arm. You try to pull free but you are trapped. Your screams echo round the chamber as whatever creature is biting you begins to suck. Your cries burble horribly into nothingness as the creature sucks every bit of moisture from your body, leaving a desiccated, empty husk hanging from the wall.","item":"","isEnd":true},{"title":"Crystal chamber","id":"843","options":[],"text":"You duck as a spear flies past you and embeds itself in the left eye of the cadet behind you. He screams and falls down dead. You clamber over the rock balcony and begin to climb down. The Captain and the others are shouting now, trying to distract the creature to give you time. It's no use though. The creature spots you and throws a spear that hits you in the back. You try to hold on but your grip weakens and you fall hundreds of feet to be literally shredded by the razor sharp crystals below.","item":"","isEnd":true},{"title":"Caves","id":"844","options":[{"text":"Go downwards","goto":"828","with":"","without":"Useless map"},{"text":"Crawl through tunnel","goto":"830","with":"","without":""},{"text":"Go downwards","goto":"835","with":"Useless map","without":""}],"text":"Pretending to spot something in the corner, you saunter away from the doorway, whistling innocently. One of the other red-shirted cadets goes to investigate. After a moment, the door slams shut.\nAll of you leap to the door, trying to force it open. Screams can be heard from within the room.\nAbruptly the screams stop and a trickle of blood runs out from under the door. When you eventually get it open, there is a pile of rock with a hand sticking out holding a strangely-shaped crystal.","item":"Strange crystal"},{"title":"Small room","id":"845","options":[{"text":"Go downwards","goto":"828","with":"","without":"Useless map"},{"text":"Crawl through tunnel","goto":"830","with":"","without":""},{"text":"Go downwards","goto":"835","with":"Useless map","without":""}],"text":"You remember the spork you picked up from the ship's mess. Quickly you jam the spork into the gap between the wall and the descending ceiling, which grinds to a halt. \nYou trying to kick the door open and you can hear the others hitting it from outside. It opens and a cadet pulls you out.\nThe spork gives way with a loud ping, embedding itself in the eye of the cadet.\nYou retrieve your spork from the eye of the dead cadet as the ceiling in the room crashes to the floor, blocking the room.","item":""},{"title":"Small room","id":"846","options":[],"text":"You bang and kick at the door but to no avail. The ceiling moves lower and lower. You try to brace it but your arms snap, then your spine. By the time your crewmates get the door open, you have been squashed flat.","item":"","isEnd":true},{"title":"Elevator","id":"847","options":[{"text":"Put hand in hole","goto":"842","with":"","without":""},{"text":"Go back","goto":"829","with":"","without":""}],"text":"You inspect the elevator but the door won't budge. There is a strangely-shaped indentation on the front of it but you can't tell if it is a keyhole, a dent or something else. There doesn't seem to be a way forward here. Perhaps the hole in the wall is part of some mechanism to control this elevator?","item":""},{"title":"Caves","id":"848","options":[],"text":"You draw your phaser, aim at the creature and press the firing button.\n\"No!!!\" screams the Science Officer.\nFloravian crystals are also one of the most useful sources of energy, used in warp drives, power plants, ship weapons etc.\nThe beam from your phaser misses the creature and hits a crystal which focuses and increases its power, splitting the beam towards all the other crystals. The explosion caused by the resulting chain reaction is powerful enough to wipe out the planet.","item":"","isEnd":true},{"title":"Cave","id":"849","options":[{"text":"Go back","goto":"830","with":"","without":""}],"text":"You duck as a spear flies past you and embeds itself in the left eye of the cadet behind you. He screams and falls down dead. The creature must be immensely powerful to throw a spear so far.\n\"Nobody fire phasers!\" shouts the Science Officer. \"It's too dangerous with Floravian crystals down there!\"\n\"We need a way down,\" says the Captain.\nYou pull the spear from the dead cadet - It's just a thin piece of sharpened wood but if you can't use your phaser, you're going to need another weapon.","item":"Spear"},{"title":"Small room","id":"850","options":[],"text":"You fire your phaser at the ceiling but it has no effect. You try again, aiming at the gap between the descending ceiling and wall , hoping to hit some sort of mechanism controlling it. Nothing. You fire at the door but the phaser power pack runs out. You bang and kick at the door but to no avail. The ceiling moves lower and lower. You try to brace it but your arms snap, then your spine. By the time your crewmates get the door open, you have been squashed flat.","item":"","isEnd":true},{"title":"Elevator","id":"851","options":[{"text":"Press 'down'","goto":"852","with":"","without":""}],"text":"You inspect the elevator but the door won't budge. There is a strangely-shaped indentation on the front of it but you can't tell if it is a keyhole, a dent or something else. You remember the oddly-shaped crystal you picked up.\nThe crystal is glowing slightly and as you click it into place in the indentation, it glows brighter and the cage door to the elevator rattles open.\n\"Good job, Cadet,\" says the Captain and all of you follow him into the elevator.","item":""},{"title":"Lower caves","id":"852","options":[{"text":"Go left","goto":"853","with":"","without":""},{"text":"Go right","goto":"854","with":"","without":""}],"text":"The elevator rattles and clanks several hundred feet down into the planet. This thing is obviously ancient and you hope that it's not about to fall apart and plunge you all to your doom. Eventually it reaches the bottom more or less in one piece.\nYou exit the elevator into a chamber carved out of the rock. There is a forked passage ahead, one fork heading to the left, one to the right.","item":""},{"title":"Lower caves","id":"853","options":[],"text":"As you make your way down the tunnel, there is an ominous rumbling and a few rocks fall from the ceiling.\n\"Run!\" shouts the Captain. As the group sprints off down the corridor, the cadet next to you stumbles and twists his ankle. You help him to his feet and the pair of you hurry as fast as you can with rocks faling all round you, trying to catch up with the others.\nThere is a loud crack right above you. \"Go without me!\" shouts the cadet but it's too late. Several tons of rock flatten you both.","item":"","isEnd":true},{"title":"Lower caves","id":"854","options":[{"text":"Look around","goto":"855","with":"","without":""}],"text":"You sprint down the corridor, dodging falling rocks. There is a scream behind you and as you look back over your shoulder you see a cadet fall and instantly buried under several tons of rocks. You keep running and the remainder of the group sprints into a large cavern. You stop to catch your breath. You seem to be safe for the moment but the tunnel behind you is full of rocks so you won't be getting back out that way.","item":""},{"title":"Lower caves","id":"855","options":[{"text":"Try to go back","goto":"853","with":"","without":""},{"text":"Onwards","goto":"856","with":"","without":""}],"text":"Quickly, the group looks round the cavern but there doesn't seem to be anything useful here. There is a tunnel leading onwards and over to the side there is another tunnel that looks like it might lead back towards the elevator.","item":""},{"title":"Crystal Cavern","id":"856","options":[{"text":"Inspect crystal","goto":"857","with":"","without":""},{"text":"Go further in","goto":"858","with":"","without":""}],"text":"You emerge into a huge cavern that stretches hundreds of feet in every direction. The cavern appears to be a geode - entirely lined with some sort of crystal. The Science Officer is scanning with his tricorder. \"Definitely Floravian crystals!\"\nThe most valuable, sought after substance in the universe! A single gram can power the quantum warp core of a ship like the Temerarius for several years. There's more wealth and power in this cavern than in the whole of the rest of the known galaxy.","item":""},{"title":"Crystal cavern","id":"857","options":[{"text":"Look around","goto":"859","with":"","without":""}],"text":"\"There's no doubt now\" says the Captain. \"This is definitely what the Kramulons were looking for. I've heard tales of such a place but it's supposed to be just a myth.\"\nYou kneel to inspect one of the oddly-glowing crystals. You reach out to touch it then pull your finger back quickly. These things are razor sharp!\nYour bleeding finger is forgotten at the sound of a loud roar that echoes round the cavern. With the echoes in the chamber, it's hard to tell which direction the sound is coming from.","item":""},{"title":"Crystal cavern","id":"858","options":[{"text":"Look around","goto":"859","with":"","without":""}],"text":"Carefully you walk further into the cavern. The oddly-glowing crystals are enough to see reasonably well but they throw weird shadows and you keep thinking that you see something moving out of the corner of your eye.\nSuddenly there is a loud roar and you stop moving. With the echoes in the cavern, it is hard to tell which direction the sound is coming from.","item":""},{"title":"Crystal cavern","id":"859","options":[{"text":"Fire phaser","goto":"861","with":"","without":"Phaser upgrade"},{"text":"Retreat","goto":"862","with":"","without":""},{"text":"Charge monster","goto":"865","with":"","without":""},{"text":"Use spear","goto":"860","with":"Spear","without":""},{"text":"Fire phaser","goto":"864","with":"Phaser upgrade","without":""},{"text":"Climb to safety","goto":"866","with":"","without":""}],"text":"\"There!\" shouts the head of Security. You look and see a large fur-covered creature shambling towards you waving a spear.\n\"No phasers!\" shouts the Science Officer. \"There's Floravian crystals everywhere!\"\nThe creature throws a spear, narrowly missing the Captain who dives aside and rolls, springing back to his feet instantly.\n\"Get ready, crew,\" he orders.","item":""},{"title":"Crystal cavern","id":"860","options":[{"text":"Block","goto":"868","with":"","without":""},{"text":"Dodge","goto":"867","with":"","without":""}],"text":"With a yell, you leap to meet the creature. You duck to avoid a swipe of it's vicious claws. As it pulls back for another swing at you, you lunge with the spear you picked up. The creature turns slightly and you only manage a glancing blow. It roars angrily and takes another swipe at you.","item":""},{"title":"Crystal cavern","id":"861","options":[{"text":"Retreat","goto":"862","with":"","without":""},{"text":"Charge monster","goto":"865","with":"","without":""},{"text":"Climb to safety","goto":"866","with":"","without":""}],"text":"Dropping to one knee, you fire your phaser at the creature, hitting it square in the chest. It staggers to a halt, roaring in pain then continues advancing, clearly enraged.\n\"I said no phasers!\" shouts the Science Officer. The head of Security slaps the phaser out of your hand before you can fire again.\n\"If you hit one of the Floravian crystals, you'll kill us all!\"\nYou apologise and holster your phaser.","item":""},{"title":"Lower caves","id":"862","options":[{"text":"Keep firing","goto":"869","with":"","without":""},{"text":"Use spear","goto":"870","with":"Spear","without":""},{"text":"Throw rock","goto":"871","with":"","without":""}],"text":"\"Fall back,\" shouts the Captain. The group retreats to the chamber outside the crystal cavern with the monster following close behind, roaring angrily.\n\"Spread out,\" orders the Captain. \"There's no crystals in here. When it follows us in, hit it with your phasers.\"\nWith a roar the monster enters the chamber and tears the nearest cadet to shreds. You all fire your phasers and the creature goes down in pain. The Captain tears off his shirt and leaps on to the creature.","item":""},{"title":"Caves","id":"863","options":[{"text":"Go back","goto":"830","with":"","without":""},{"text":"Climb down","goto":"843","with":"","without":""},{"text":"Fire phaser","goto":"848","with":"","without":""}],"text":"The cave opens out onto a wide balcony with a dead cadet lying on the floor. As you approach the edge you can see into the depths. There are crystals sparkling as far as the eye can see. A huge fur-covered monster roars and throws a spear. You duck back just in time for it to miss you.","item":""},{"title":"Crystal cavern","id":"864","options":[],"text":"You draw your phaser, aim at the creature and press the firing button.\n\"No!!!\" screams the Science Officer.\nThe beam from your phaser passes through the creature, killing it, and hits a crystal which focuses and increases its power, splitting the beam towards all the other crystals. The explosion caused by the resulting chain reaction is powerful enough to wipe out the planet.","item":"","isEnd":true},{"title":"Crystal cavern","id":"865","options":[],"text":"With a yell you charge, ramming your shoulder into the creature. It swipes at you as it falls, knocking you flying and smashing out several of your teeth. The creature lands on a spike of crystal, impaling it. You land on a patch of smaller crystals, slicing you into pieces. The cuts are so clean that your body doesn't even realise it's dead.\n\"Can you put the cadet back together?\" the Captain asks the Medical Officer.\nThe last thing you hear is, \"Dammit Jim! I'm a doctor, not Frankenstein.\"","item":"","isEnd":true},{"title":"Crystal cavern","id":"866","options":[],"text":"\"I'll go for help!\" you shout as you dodge past the monster. If you can climb to the balcony you can see above, you might be able to get back to the surface and contact the ship for backup.\nThe others are shouting, trying to distract the creature as you climb. It's no use though. The creature spots you and throws a spear that hits you in the back. You try to hold on but your grip weakens and you fall hundreds of feet to be literally shredded by the razor sharp crystals below.","item":"","isEnd":true},{"title":"Crystal cavern","id":"867","options":[{"text":"Continue","goto":"872","with":"","without":""}],"text":"You duck another swipe from the monster, stepping backwards, trying not to trip and fall on the sharp crystals everywhere.\nYou stumble and go down on one knee. The creature steps forwards, swinging again and you duck, thrusting the spear upwards into the creature's belly. It roars in pain and staggers back, falling to impale itself on a large spike of Floravian crystal.","item":""},{"title":"Crystal cavern","id":"868","options":[],"text":"As the creature takes another swipe at you, you raise the spear in both hands to block. The creature smashes through the thin wood as if it wasn't there. Its claws continue on their deadly arc, slicing your head into four pieces and killing you instantly.","item":"","isEnd":true},{"title":"Lower caves","id":"869","options":[],"text":"The Captain's muscles ripple as he flexes his arms, trying to choke the creature as it tries to tear at him with its claws. Carefully you aim you phaser and fire.\nAs you do so, the creature's struggles knock the Captain into your line of fire and your phaser beam hits him. With a swipe, the creature guts the Captain, flinging his broken body against the wall of the cave.\nBefore it succumbs to the concentrated fire of all your phasers, the creature manages one last swipe that removes your head.","item":"","isEnd":true},{"title":"Lower caves","id":"870","options":[{"text":"Continue","goto":"872","with":"","without":""}],"text":"The Captain's muscles ripple as he flexes his arms, trying to choke the creature as it tries to tear at him with its claws. Struggling to breathe, the creature slams backwards, bashing the Captain against the wall and trying to knock him off. You see your opportunity. With a yell you charge the creature, ramming your spear into its belly. It screams in pain and falls to it's knees, struggling feebly as the Captain snaps its neck.\n\"Good work, Cadet,\" he says.","item":""},{"title":"Lower caves","id":"871","options":[{"text":"Continue","goto":"872","with":"","without":""}],"text":"The Captain's muscles ripple as he flexes his arms, trying to choke the creature as it tries to tear at him with its claws. Struggling to breathe, the creature slams backwards, bashing the Captain against the wall and trying to knock him off. You see your opportunity. You grab a large rock and charge the creature, smashing the rock into its face. It screams in pain and falls to it's knees, struggling feebly as the Captain snaps its neck.\n\"Good work, Cadet,\" he says.","item":""},{"title":"Crystal cavern","id":"872","options":[{"text":"Continue","goto":"873","with":"","without":""}],"text":"You make your way back to the cavern to explore it properly. The place is huge but there appear to be no other ways out.\n\"Over here,\" calls the head of Security.\nYou all make your way over to find him standing over the body of a dead Kramulon. The Kramulon appears to have been ripped apart by the creature that lived in the cavern. There are several pieces of surveying equipment near the body and a Kramulon communicator.","item":""},{"title":"Crystal cavern","id":"873","options":[{"text":"Try to go back","goto":"874","with":"","without":""},{"text":"Climb out","goto":"875","with":"","without":""},{"text":"Check communicator","goto":"876","with":"","without":""}],"text":"\"We need to get back to the ship and contact Space Fleet,\" says the Captain. \"They need to know about these Floravian crystals. If there was only one Kramulon ship in orbit then either we arrived before they had a chance to contact the Empire or there is a Kramulon fleet already on the way.\"\nYou all check your communicators but with all this rock in the way and surrounded by Floravian crystals, you can't get through.","item":""},{"title":"Lower caves","id":"874","options":[{"text":"Climb out","goto":"875","with":"","without":""},{"text":"Check Kramulon communicator","goto":"876","with":"","without":""}],"text":"\"Let's see if we can get to the elevator,\" says the Captain.\nYou all make your way out of the crystal cavern back to the other tunnel. You follow it for a while but there has been a rock fall, blocking the way. There is an ominous rumbling above you and you quickly return to the crystal cavern before the ceiling collapses any more.","item":""},{"title":"Crystal cavern","id":"875","options":[{"text":"\"Yes sir!\"","goto":"877","with":"","without":""},{"text":"\"Maybe not...\"","goto":"878","with":"","without":""}],"text":"You look up at a balcony visible far above you. It's a dangerous looking climb - several hundred feet and razor sharp Floravian crystals everywhere. It might not even be possible but it might be worth a try. There don't seem to be any other ways out.\n\"Captain,\" you say, \"I could try climbing up there. If I can find a way back to the surface I can contact the ship.\"\nThe Captain looks at the wall of the cavern. \"It's a dangerous climb, Cadet. Are you sure you're up for it?\"","item":""},{"title":"Crystal cavern","id":"876","options":[{"text":"Use power cell","goto":"879","with":"Kramulon power cell","without":""},{"text":"Use Floravian crystal","goto":"880","with":"Navigation codes","without":""},{"text":"Use phaser power","goto":"881","with":"Tactical codes","without":""},{"text":"Use wrist computer","goto":"882","with":"Comms access","without":""},{"text":"Try something else","goto":"883","with":"","without":""},{"text":"Use upgraded Phaser battery","goto":"885","with":"Phaser upgrade","without":""}],"text":"The Captain picks up the Kramulon communicator. \"Maybe their communicators could get through the rock and crystal?\" He taps a button. \"No power.\"\n","item":""},{"title":"Crystal cavern","id":"877","options":[{"text":"Continue","goto":"200","with":"","without":""}],"text":"\"I can do this, sir.\"\n\"Make it so.\"\nYou begin to climb, being careful not to touch and shrp Floravian crystals. It takes you an hour and you are almost exhausted but you reach the balcony and haul yourself onto it. Nursing the cuts on your hands, you find your way out of the cavern and contact the ship.\nYou almost cry with relief when they answer and begin planning a rescue mission.","item":""},{"title":"Crystal cavern","id":"878","options":[{"text":"Lunch break","goto":"884","with":"","without":""},{"text":"Check Kramulon communicator","goto":"876","with":"","without":""}],"text":"\"Uh...I don't think I can, after all.\"\nThe Captain looks disappointed.\n\"I'll go, Jim,\" says the head of Security. \"Here, take this.\" He hands you a thermal detonator.\n\"If I get to the top and the Kramulons are here, you need to blow the cavern to stop them getting the Floravian crystals.\"\nHe begins to climb.","item":"Thermal detonator"},{"title":"Crystal cavern","id":"879","options":[{"text":"Continue","goto":"201","with":"","without":""}],"text":"\"Sir, I found this.\"\nYou hand the Kramulon power cell to the Captain.\n\"Perfect!\" He slots the power cell into the communicator and turns it on. He adjusts the frequencies to match Space Fleet communications protocols and tries to contact the Temerarius.\nThe signal is weak but you all cheer as the ship answers. Now a link is established, it is only a few seconds until the sparkly lights surround you and you are beamed back to the ship.","item":""},{"title":"Crystal cavern","id":"880","options":[{"text":"Continue","goto":"202","with":"","without":""}],"text":"\"Perhaps we could power it with a Floravian crystal?\"\n\"Good idea, Cadet.\"\nThe Science Officer selects a tiny Floravian crystal and you all return to the chamber outside the crystal cavern.\nIt takes him about half an hour to rig the communicator.\n\"We only get one shot at this, it will probably burn the communicator out quickly so we need to make sure we aim our signal where the ship is going to be.\"\nYou tap the calculations into your wrist computer and point to where the ship should be.","item":""},{"title":"Crystal cavern","id":"881","options":[{"text":"Continue","goto":"203","with":"","without":""}],"text":"\"Could we use a phaser to power it?\"\nThe Science Officer rigs it together and you carefully fire your phaser at the power chamber of the communicator.\nThe signal is weak but you all cheer when the ship answers. The communicator burns out quickly and the feedback destroys your phaser, throwing you backwards into a patch of razor sharp crystals and causing massive damage.\nNow there's a link, though it's only few minutes later that the sparkly lights envelop you as you are beamed back to the ship.","item":""},{"title":"Crystal cavern","id":"882","options":[{"text":"Continue","goto":"204","with":"","without":""}],"text":"\"Perhaps we could reroute the Kramulon communicator circuits through one of our wrist computers and use it to boost our own communicator signal?\" you suggest.\nYou rig it together and you try to contact the ship. The signal is weak but the ship answers. The communicator burns out quickly and the feedback to your computer throws you into a patch of sharp crystals, causing massive damage.\nNow there's a link, it's possible to beam you back to the ship.","item":""},{"title":"Crystal cavern","id":"883","options":[{"text":"Climb out","goto":"875","with":"","without":"Thermal detonator"},{"text":"Use Floravian crystal","goto":"886","with":"","without":"Navigation codes"},{"text":"Dismantle communicator","goto":"887","with":"","without":""},{"text":"Lunch break","goto":"884","with":"Thermal detonator","without":""}],"text":"\"I've got an idea, Captain.\"\n\"Yes, Cadet?\"","item":""},{"title":"Crystal cavern","id":"884","options":[],"text":"\"How about a lunch break?\"\nThe Captain agrees. You find a space to sit and chomp your Space Fleet protein bars as you watch the head of Security climbing to the balcony.\nHe makes it to the top and disappears over the edge of the balcony. There is a lot of shouting and he comes sailing back over the balcony, screaming as he plummets to his death.\nKramulons! Warriors appear at the balcony, shouting. The Captain has no choice but to activate the detonator, destroying the cavern and half the planet.","item":"","isEnd":true},{"title":"Crystal cavern","id":"885","options":[],"text":"\"We could try using my phaser power pack to get the communicator working?\"\n\"That might just work.\" The Science Officer spends the next half an hour rigging the Kramulon communicator to accept the phaser power pack. He turns the communicator on and there is an ominous rising whine. He presses buttons but the whine continues rising.\n\"It's overloading! Is this an upgraded power pack?!\"\nThe explosion of the communicator starts a chain reaction in the Floravian crystals that destroys the planet.","item":"","isEnd":true},{"title":"Crystal cavern","id":"886","options":[],"text":"\"Could we use a Floravian crystal to power it?\"\n\"Hmmm,\" muses the Science Officer. \"It's risky but if we're careful it might work.\n\"Make it so,\" orders the Captain.\nThe Science Officer spends the next half hour rigging the communicator to use a Floravian crystal. He turns it on and there is an ominous rising whine. He presses buttons but the whine continues rising.\n\"It's overloading!\"\nThe explosion of the communicator starts a chain reaction in the Floravian crystals that destroys the planet.","item":"","isEnd":true},{"title":"Crystal cavern","id":"887","options":[{"text":"Climb out","goto":"875","with":"","without":"Thermal detonator"},{"text":"Lunch break","goto":"884","with":"Thermal detonator","without":""}],"text":"\"Here, let me try something.\"\nThe Science Officer hands the communicator to you and you quickly dismantle it. Nothing. You try to put it back together but none of the bits seem to fit properly now.\n\"Oops.\"\n\"Was that your plan?\" asks the Captain. \nWhat now?","item":""},{"title":"SFV Temerarius","id":"200","options":[],"text":"A shuttle landed and rescued the away team. Space Fleet immediately sent a large fleet to protect the planet from anyone else trying to get the Floravian crystals.\nThe Captain congratulates you, \"Perfectly adequate performance for your first day, Cadet. Keep this up and you'll make Lieutenant in a few years.\"\nBack at the ship's barracks, you collapse on your bunk to get some sleep ready to do it all over again tomorrow - another glorious day as a Space Fleet Cadet!","item":"","isWin":true,"winIcon":"crown"},{"title":"SFV Temerarius","id":"201","options":[],"text":"As soon as you arrive back on the ship, the Captain contacts Space Fleet who immediately send a large fleet to protect the planet from anyone else trying to get the Floravian crystals.\nThe Captain congratulates you, \"Perfectly adequate performance for your first day, Cadet. Keep this up and you'll make Lieutenant in a few years.\"\nBack at the ship's barracks, you collapse on your bunk to get some sleep ready to do it all over again tomorrow - another glorious day as a Space Fleet Cadet!","item":"","isWin":true,"winIcon":"crown"},{"title":"SFV Temerarius","id":"202","options":[],"text":"The signal gets through and you're beamed back to the ship. The Captain contacts Space Fleet to send a large fleet to protect the planet from anyone else trying to get the Floravian crystals.\nThe Captain congratulates you, \"Perfectly adequate performance for your first day, Cadet. Keep this up and you'll make Navigation Officer in a few years.\"\nAt the ship's barracks, you collapse on your bunk to get some sleep ready to do it all over again tomorrow - another glorious day as a Space Fleet Cadet!","item":"","isWin":true,"winIcon":"crown"},{"title":"SFV Temerarius","id":"203","options":[{"text":"Continue","goto":"205","with":"","without":""}],"text":"You awake in Sick Bay.\n\"I'm afraid we had to amputate your foot,\" says the Medical Officer. \"And your whole leg, and your other leg, both arms, half your nose, both ears, your voice box, your spleen and part of your spine. We replaced your eyes with a bionic visor.\"\nThe captain comes in. \"Glad to see you alive, Cadet. Well done - perfectly adequate performance for your first day, Keep it up and you'll make Tactical Officer in no time.\"\nHe salutes. You don't salute back, you have no arms.","item":""},{"title":"new chapter","id":"204","options":[{"text":"Continue","goto":"205","with":"","without":""}],"text":"You awake in Sick Bay.\n\"I'm afraid we had to amputate your foot,\" says the Medical Officer. \"And your whole leg, and your other leg, both arms, half your nose, both ears, your voice box, your spleen and part of your spine. We replaced your eyes with a bionic visor.\"\nThe captain comes in. \"Glad to see you alive, Cadet. Well done - perfectly adequate performance for your first day, Keep it up and you'll make Communications Officer in no time.\"\nHe salutes. You don't salute back, you have no arms.","item":""},{"title":"new chapter","id":"205","options":[],"text":"It takes two weeks to recover but soon you are back on duty, reporting to the transporter room for another away mission.\nYour powered chair wheels you in and you beep - your only means of communication. The Captain nods and you wheel up the ramp onto your transporter pad, ready to start another glorious day as a Space Fleet Cadet!","item":"","isWin":true,"winIcon":"crown"}]}